# Downloaded from https://github.com/autopkg/apizz-recipes/blob/89924a4aa3d364e3b0a841917b34d380772a371a/Google_Drive/GoogleDrive_app.munki.recipe
# Commit: 89924a4aa3d364e3b0a841917b34d380772a371a
# Downloaded at: 2026-02-22 01:50:31 UTC

Description: "Downloads the latest version of Google Drive (previously File Stream) and imports it into a munki_repo.\n\nSince Google Drive has macOS architecture specific PKGs that won't be installed, this will cause an endless install loop if the applicable PKG receipts aren't marked as optional. Unlike the sister GoogleDrive.munki.recipe which uses the PKG receipts to determine the install status, this recipe instead refers to the installed app version."
Identifier: com.github.apizz.munki.GoogleDrive_app
Input:
  MUNKI_CATEGORY: Backups
  MUNKI_REPO_SUBDIR: apps/googledrive
  NAME: GoogleDrive
  pkginfo:
    catalogs:
    - testing
    category: '%MUNKI_CATEGORY%'
    description: "With Google Drive, you stream your Drive files directly from the cloud to your Mac or PC, freeing up disk space and network bandwidth. Because Drive files are stored in the cloud, any changes you or your collaborators make are automatically updated everywhere. You\u2019ll always have the latest version.\n\nYou can also make Drive files available for offline access. These cached files sync back to the cloud when you're online, so the latest version is available on all your devices."
    developer: Google Inc.
    display_name: Google Drive
    name: '%NAME%'
    unattended_install: true
MinimumVersion: 2.7.1
ParentRecipe: com.github.nstrauss.download.GoogleDrive
Process:
- Processor: Copier
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/GoogleDrive.pkg'
    overwrite: true
    source_path: '%pathname%/GoogleDrive.pkg'
- Processor: FlatPkgUnpacker
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/unpack'
    flat_pkg_path: '%RECIPE_CACHE_DIR%/GoogleDrive.pkg'
- Processor: PkgPayloadUnpacker
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/%NAME%/Applications'
    pkg_payload_path: '%RECIPE_CACHE_DIR%/unpack/GoogleDrive_arm64.pkg/Payload'
  Comment: Expand the arm64 app version. Assumes info is same as for x86_64.
- Processor: PlistReader
  Arguments:
    info_path: '%RECIPE_CACHE_DIR%/%NAME%/Applications/Google Drive.app/Contents/Info.plist'
    plist_keys:
      CFBundleVersion: version
- Processor: MunkiPkginfoMerger
  Arguments:
    additional_pkginfo:
      version: '%version%'
- Processor: MunkiInstallsItemsCreator
  Arguments:
    derive_minimum_os_version: true
    faux_root: '%RECIPE_CACHE_DIR%/%NAME%'
    installs_item_paths:
    - /Applications/Google Drive.app
    version_comparison_key: CFBundleVersion
- Processor: MunkiPkginfoMerger
  Arguments: {}
- Processor: MunkiImporter
  Arguments:
    pkg_path: '%RECIPE_CACHE_DIR%/GoogleDrive.pkg'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
- Processor: PathDeleter
  Arguments:
    path_list:
    - '%RECIPE_CACHE_DIR%/%NAME%'
    - '%RECIPE_CACHE_DIR%/GoogleDrive.pkg'
    - '%RECIPE_CACHE_DIR%/unpack'
