# Downloaded from https://github.com/autopkg/rtrouton-recipes/blob/7d4886a0c21b4990c2fe43b23bcaaf8477363734/MicrosoftPowerPoint365/MicrosoftPowerPoint365.install.recipe
# Commit: 7d4886a0c21b4990c2fe43b23bcaaf8477363734
# Downloaded at: 2026-02-22 01:46:28 UTC

Description: Downloads the current release version of the Microsoft PowerPoint installer package for Office 365 and installs it.
Identifier: com.github.rtrouton.install.microsoftpowerpoint365
Input:
  NAME: Microsoft PowerPoint
MinimumVersion: 1.0.0
ParentRecipe: com.github.rtrouton.pkg.microsoftpowerpoint365
Process:
- Processor: Installer
