# Downloaded from https://github.com/autopkg/rtrouton-recipes/blob/7d4886a0c21b4990c2fe43b23bcaaf8477363734/MicrosoftPowerPoint365/MicrosoftPowerPoint365.pkg.recipe
# Commit: 7d4886a0c21b4990c2fe43b23bcaaf8477363734
# Downloaded at: 2026-02-22 01:46:28 UTC

Description: Downloads the latest version of Microsoft's PowerPoint for Office 365 installer package and renames the package.
Identifier: com.github.rtrouton.pkg.microsoftpowerpoint365
Input:
  NAME: Microsoft PowerPoint
  VENDOR: Microsoft
  SOFTWARETITLE: PowerPoint
  VERSIONTYPE: CFBundleVersion
MinimumVersion: 1.0.0
ParentRecipe: com.github.rtrouton.download.microsoftpowerpoint365
Process:
- Processor: FlatPkgUnpacker
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/downloads/unpack'
    flat_pkg_path: '%pathname%'
- Processor: FileFinder
  Arguments:
    pattern: '%RECIPE_CACHE_DIR%/downloads/unpack/*PowerPoint*.pkg'
- Processor: PkgPayloadUnpacker
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/downloads/payload'
    pkg_payload_path: '%found_filename%/Payload'
- Processor: Versioner
  Arguments:
    input_plist_path: '%RECIPE_CACHE_DIR%/downloads/payload/Microsoft PowerPoint.app/Contents/Info.plist'
    plist_version_key: '%VERSIONTYPE%'
- Processor: PkgCopier
  Arguments:
    source_pkg: '%pathname%'
    pkg_path: '%RECIPE_CACHE_DIR%/%VENDOR%_%SOFTWARETITLE%_%version%.pkg'
- Processor: PathDeleter
  Arguments:
    path_list:
    - '%RECIPE_CACHE_DIR%/downloads/unpack'
    - '%RECIPE_CACHE_DIR%/downloads/payload'
