# Downloaded from https://github.com/autopkg/scriptingosx-recipes/blob/8a19293caf528805e0ef5dda9e4edc7295e4eeb6/WhatsAppInc/WhatsApp.munki.recipe
# Commit: 8a19293caf528805e0ef5dda9e4edc7295e4eeb6
# Downloaded at: 2026-02-22 01:49:16 UTC

Comment: Created with Recipe Robot v1.0.2 (https://github.com/homebysix/recipe-robot)
Description: Downloads the latest version of WhatsApp and imports it into Munki.
Identifier: com.scriptingosx.munki.WhatsApp
Input:
  MUNKI_REPO_SUBDIR: apps/%NAME%
  NAME: WhatsApp
  pkginfo:
    catalogs:
    - testing
    category: Communication
    description: "WhatsApp Messenger is a cross-platform mobile messaging app which allows you to exchange messages without having to pay for SMS. WhatsApp Messenger is available for iPhone, BlackBerry, Android, Windows Phone and Nokia and yes, those phones can all message each other! Because WhatsApp Messenger uses the same internet data plan that you use for email and web browsing, there is no cost to message and stay in touch with your friends.\n\nIn addition to basic messaging WhatsApp users can create groups, send each other unlimited images, video and audio media messages."
    developer: WhatsApp Inc.
    display_name: WhatsApp
    name: '%NAME%'
    unattended_install: true
MinimumVersion: 0.6.1
ParentRecipe: com.scriptingosx.download.WhatsApp
Process:
- Processor: MunkiImporter
  Arguments:
    pkg_path: '%pathname%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
