# Downloaded from https://github.com/autopkg/nstrauss-recipes/blob/e58bfac92f1739258afd8cf246d148e1b60fd986/Okta Verify/OktaVerify.pkg.recipe
# Commit: e58bfac92f1739258afd8cf246d148e1b60fd986
# Downloaded at: 2026-02-22 01:47:22 UTC

Description: Download Okta Verify and copy to versioned package.
Identifier: com.github.nstrauss.pkg.OktaVerify
Input:
  NAME: OktaVerify
MinimumVersion: '1.0'
ParentRecipe: com.github.nstrauss.download.OktaVerify
Process:
- Processor: FlatPkgUnpacker
  Arguments:
    flat_pkg_path: '%pathname%'
    destination_path: '%RECIPE_CACHE_DIR%/unpack'
    purge_destination: true
- Processor: PkgPayloadUnpacker
  Arguments:
    pkg_payload_path: '%RECIPE_CACHE_DIR%/unpack/Okta Verify.pkg/Payload'
    destination_path: '%RECIPE_CACHE_DIR%/payload/Applications'
    purge_destination: true
- Processor: Versioner
  Arguments:
    input_plist_path: '%RECIPE_CACHE_DIR%/payload/Applications/Okta Verify.app/Contents/Info.plist'
    plist_version_key: CFBundleShortVersionString
- Processor: PlistReader
  Arguments:
    info_path: '%RECIPE_CACHE_DIR%/payload/Applications/Okta Verify.app/Contents/Info.plist'
    plist_keys:
      CFBundleVersion: ov_build
- Processor: PkgCopier
  Arguments:
    source_pkg: '%pathname%'
    pkg_path: '%RECIPE_CACHE_DIR%/%NAME%-%version%.%ov_build%.pkg'
