# Downloaded from https://github.com/autopkg/dataJAR-recipes/blob/4e1be9dc49c30ad4b1ccdd3d0b090522684032e6/Visual Studio/Xamarin Profiler.munki.recipe
# Commit: 4e1be9dc49c30ad4b1ccdd3d0b090522684032e6
# Downloaded at: 2026-02-22 01:49:05 UTC

Comment: 'manifest URL obtained from this thread on Jamf Nation: https://community.jamf.com/t5/jamf-pro/visual-studio-for-mac-deployment/m-p/292547/highlight/true#M260110'
Description: Downloads the latest version of Xamarin Profiler for Visual Studio and imports it into Munki.
Identifier: com.github.dataJAR-recipes.munki.Xamarin Profiler
Input:
  NAME: XamarinProfiler
  MUNKI_REPO_SUBDIR: apps/%NAME%
  pkginfo:
    catalogs:
    - testing
    description: "Xamarin Profiler for Visual Studio\n\nThe Xamarin Profiler is a graphical interface for the Mono log profiler, and supports profiling Android, iOS, tvOS, and Mac applications on Mac, and Android, iOS, and tvOS applications on Windows."
    developer: Microsoft Corporation
    display_name: Xamarin Profiler
    name: '%NAME%'
    unattended_install: true
    unattended_uninstall: true
MinimumVersion: '1.1'
ParentRecipe: com.github.dataJAR-recipes.download.Xamarin Profiler
Process:
- Processor: FlatPkgUnpacker
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/unpacked'
    flat_pkg_path: '%RECIPE_CACHE_DIR%/downloads/profiler-mac-%Xamarinprofiler_VERSION%.pkg'
    purge_destination: true
- Processor: PkgPayloadUnpacker
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/Applications'
    pkg_payload_path: '%RECIPE_CACHE_DIR%/unpacked/com.xamarin.profiler.pkg/Payload'
    purge_destination: true
- Processor: MunkiInstallsItemsCreator
  Arguments:
    faux_root: '%RECIPE_CACHE_DIR%'
    installs_item_paths:
    - /Applications/Xamarin Profiler.app
- Processor: MunkiPkginfoMerger
- Processor: URLTextSearcher
  Arguments:
    re_pattern: '\"minimumSupportedOsVersion\": \"([0-9]*\.[0-9]+)\",'
    result_output_var_name: min_os_ver
    url: https://aka.ms/vsmac/manifest/17-stable
- Processor: MunkiPkginfoMerger
  Arguments:
    additional_pkginfo:
      minimum_os_version: '%min_os_ver%'
- Processor: MunkiImporter
  Arguments:
    pkg_path: '%RECIPE_CACHE_DIR%/downloads/profiler-mac-%Xamarinprofiler_VERSION%.pkg'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
- Processor: PathDeleter
  Arguments:
    path_list:
    - '%RECIPE_CACHE_DIR%/unpacked'
    - '%RECIPE_CACHE_DIR%/Applications'
