# Downloaded from https://github.com/autopkg/timsutton-recipes/blob/9193e16e06f78c6e9692955c13737c8b5e6e56a6/Blackmagic/DaVinciResolveLite11.munki.recipe
# Commit: 9193e16e06f78c6e9692955c13737c8b5e6e56a6
# Downloaded at: 2025-11-27 22:30:20 UTC

Description: "Downloads the most recent version of DaVinci Resolve Lite 11 and imports into Munki.\n\nPlease see directions in the download recipe about additional Input variables required for this\nrecipe.\n\nWe extract the application bundle so that we can use it for an installs item and the pkginfo version.\n\nResolve Lite also includes the CUDA driver installed via a postinstall script. It may or may not\ninstall, depending on whether a equivalent version of the CUDA driver exists already on the system.\nThe postinstall script calls another script located within the application bundle to perform the\nactual installation. It can be found here within this recipe's CACHE_DIR (look for CUDA_VER):\n\npkg_payload/Library/Application Support/Blackmagic Design/DaVinci Resolve/Prereqs/install.sh\n\nEven if the CUDA driver does install via the Resolve Lite installer pkg, it should not require a\nrestart, as it reloads its kext and support daemons in postinstall scripts. You may consider\nadding the CUDA driver as a separate item in Munki and adding it as a 'requires' for Resolve.\n\nOne caveat with this package, is that this installer runs a script that evalutes\nthe owner of /dev/console to derive a home directory, which then is configured system-wide\nas a cache location for Resolve. If this installer is run while a user is logged in, then\nthis user's home will be used, and if run at the loginwindow, the root user's home will be.\n"
Identifier: com.github.timsutton.munki.davinciresolvelite11
Input:
  NAME: DaVinciResolveLite11
  MUNKI_REPO_SUBDIR: apps/%NAME%
  pkginfo:
    catalogs:
    - testing
    description: "DaVinci color correctors have been the standard in post production since 1984. There are thousands of colorists worldwide who understand the performance, quality and workflow of DaVinci. DaVinci is the name behind more feature films, television commercials, documentaries, television production and music videos than any other grading system. When you\u2019re in a room full of demanding clients with conflicting ideas, colorists know that only DaVinci has the quality, real time performance, creative features and powerful control panel you need to work fast!"
    display_name: DaVinci Resolve Lite 11
    minimum_os_version: 10.8.5
    name: '%NAME%'
    uninstallable: true
    uninstall_method: uninstall_script
    uninstall_script: "#!/bin/sh\n            # Run the uninstaller script provided with the app.\n            # Alternatively, replace this with your own version of their uninstaller.\n            # For example, their uninstaller intentionally leaves the following on the\n            # system, which you may disagree with:\n            # - /Library/Application Support/Blackmagic Design/DaVinci Resolve\n            # - /Library/Preferences/Blackmagic Design/DaVinci Resolve\n            #\n            # Their uninstaller is also executable and world-writable.\n\n            UNINSTALL_SCRIPT=\"/Applications/DaVinci Resolve/Uninstall Resolve.app/Contents/Resources/uninstall.sh\"\n\n            [ -x \"${UNINSTALL_SCRIPT}\" ] || exit 1\n            \"${UNINSTALL_SCRIPT}\"\n            "
MinimumVersion: 0.2.9
ParentRecipe: com.github.timsutton.download.davinciresolvelite11
Process:
- Processor: Unarchiver
  Arguments:
    archive_path: '%pathname%'
    destination_path: '%RECIPE_CACHE_DIR%/unzip'
    purge_destination: true
- Processor: FileFinder
  Arguments:
    pattern: '%RECIPE_CACHE_DIR%/unzip/*.dmg'
- Processor: FlatPkgUnpacker
  Arguments:
    flat_pkg_path: '%found_filename%/*.pkg'
    destination_path: '%RECIPE_CACHE_DIR%/distpkg'
- Processor: PkgPayloadUnpacker
  Arguments:
    pkg_payload_path: '%RECIPE_CACHE_DIR%/distpkg/Manifest.pkg/Payload'
    destination_path: '%RECIPE_CACHE_DIR%/pkg_payload'
- Processor: PlistReader
  Arguments:
    info_path: '%RECIPE_CACHE_DIR%/pkg_payload/Applications/DaVinci Resolve/DaVinci Resolve.app'
- Processor: MunkiInstallsItemsCreator
  Arguments:
    faux_root: '%RECIPE_CACHE_DIR%/pkg_payload'
    installs_item_paths:
    - /Applications/DaVinci Resolve/DaVinci Resolve.app
- Processor: MunkiPkginfoMerger
- Processor: MunkiPkginfoMerger
  Arguments:
    additional_pkginfo:
      version: '%version%'
- Processor: MunkiImporter
  Arguments:
    pkg_path: '%found_filename%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
