# Downloaded from https://github.com/autopkg/recipes/blob/4b5a199119b507053f074f17d7955f1f21f612f0/munkitools/munkitools6.munki.recipe
# Commit: 4b5a199119b507053f074f17d7955f1f21f612f0
# Downloaded at: 2026-02-22 01:50:06 UTC

Description: "Downloads and imports the unsigned release of Munki tools version 6\nvia the official releases listing on GitHub. You can set INCLUDE_PRERELEASES\nto any value to have this recipe pull prerelease versions.\n\nNOTE: Use the \"com.github.autopkg.munki.munkitools6-signed\" recipe to\ndownload the code signed version of the Munki tools via Mac Admins Open Source.\n\nThis recipe cannot be overridden to pull a download from an alternate location.\n\nThe GitHubReleasesInfoProvider processor used by this recipe also\nrespects an input variable: 'sort_by_highest_tag_names', which\nif set, will ignore the post dates of the releases and instead sort\ndescending by tag names according to LooseVersion semantics.\n"
Identifier: com.github.autopkg.munki.munkitools6
Input:
  INCLUDE_PRERELEASES: ''
  NAME: munkitools
  MUNKI_REPO_SUBDIR: munkitools
  MUNKI_ICON: munkitools.png
  pkginfo:
    catalogs:
    - development
    category: munkitools
    description: Managed software installation for macOS.
    developer: The Munki Project
    display_name: Managed Software Center
    icon_name: '%MUNKI_ICON%'
    minimum_os_version: '10.13'
    name: '%NAME%'
    unattended_install: true
MinimumVersion: 0.5.0
Process:
- Processor: GitHubReleasesInfoProvider
  Arguments:
    asset_regex: ^munkitools-6.*?pkg$
    github_repo: munki/munki
    include_prereleases: '%INCLUDE_PRERELEASES%'
- Processor: URLDownloader
- Processor: EndOfCheckPhase
- Processor: MunkiImporter
  Arguments:
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
    pkg_path: '%pathname%'
