# Downloaded from https://github.com/autopkg/recipes/blob/4b5a199119b507053f074f17d7955f1f21f612f0/GoogleChrome/GoogleChrome.install.recipe
# Commit: 4b5a199119b507053f074f17d7955f1f21f612f0
# Downloaded at: 2026-02-22 01:44:37 UTC

Description: Downloads latest Google Chrome disk image and installs Google Chrome.
Identifier: com.github.autopkg.install.googlechrome
Input: {}
MinimumVersion: 0.4.0
ParentRecipe: com.github.autopkg.download.googlechrome
Process:
- Processor: InstallFromDMG
  Arguments:
    dmg_path: '%pathname%'
    items_to_copy:
    - source_item: Google Chrome.app
      destination_path: /Applications/
