# Downloaded from https://github.com/autopkg/recipes/blob/4b5a199119b507053f074f17d7955f1f21f612f0/GoogleChrome/GoogleChromePkg.pkg.recipe
# Commit: 4b5a199119b507053f074f17d7955f1f21f612f0
# Downloaded at: 2026-02-22 01:44:38 UTC

Description: Downloads latest Google Chrome enterprise package and renames it based on the Chrome version.
Identifier: com.github.autopkg.pkg.googlechromepkg
Input:
  NAME: GoogleChrome
MinimumVersion: 1.4.1
ParentRecipe: com.github.autopkg.download.googlechromepkg
Process:
- Processor: FlatPkgUnpacker
  Arguments:
    flat_pkg_path: '%pathname%'
    destination_path: '%RECIPE_CACHE_DIR%/unpack'
- Processor: PkgPayloadUnpacker
  Arguments:
    pkg_payload_path: '%RECIPE_CACHE_DIR%/unpack/GoogleChrome.pkg/Payload'
    destination_path: '%RECIPE_CACHE_DIR%/unpack'
- Processor: PlistReader
  Arguments:
    info_path: '%RECIPE_CACHE_DIR%/unpack/Google Chrome.app'
- Processor: PkgCopier
  Arguments:
    source_pkg: '%pathname%'
    pkg_path: '%RECIPE_CACHE_DIR%/GoogleChrome-%version%.pkg'
- Processor: PathDeleter
  Arguments:
    path_list:
    - '%RECIPE_CACHE_DIR%/unpack'
