# Downloaded from https://github.com/autopkg/recipes/blob/4aa2d9380d7f8ba54af95915c8c47a73fcf88acf/GoogleChrome/GoogleChrome.pkg.recipe
# Commit: 4aa2d9380d7f8ba54af95915c8c47a73fcf88acf
# Downloaded at: 2025-11-27 22:27:43 UTC

Description: Downloads latest Google Chrome disk image and builds a package.
Identifier: com.github.autopkg.pkg.googlechrome
Input:
  NAME: GoogleChrome
ParentRecipe: com.github.autopkg.download.googlechrome
Process:
- Processor: AppDmgVersioner
  Arguments:
    dmg_path: '%pathname%'
- Processor: PkgRootCreator
  Arguments:
    pkgroot: '%RECIPE_CACHE_DIR%/%NAME%'
    pkgdirs:
      Applications: '0775'
- Processor: Copier
  Arguments:
    source_path: '%pathname%/%app_name%'
    destination_path: '%pkgroot%/Applications/%app_name%'
- Processor: PkgCreator
  Arguments:
    pkg_request:
      pkgname: '%NAME%-%version%'
      version: '%version%'
      id: '%bundleid%'
      chown:
      - path: Applications
        user: root
        group: admin
