# Downloaded from https://github.com/autopkg/recipes/blob/4b5a199119b507053f074f17d7955f1f21f612f0/GoogleChrome/GoogleChrome.munki.recipe
# Commit: 4b5a199119b507053f074f17d7955f1f21f612f0
# Downloaded at: 2026-02-22 01:44:37 UTC

Description: Downloads the latest Google Chrome disk image and imports into Munki.
Identifier: com.github.autopkg.munki.google-chrome
Input:
  NAME: GoogleChrome
  MUNKI_REPO_SUBDIR: apps
  pkginfo:
    catalogs:
    - testing
    description: Chrome is a fast, simple, and secure web browser, built for the modern web.
    display_name: Google Chrome
    name: '%NAME%'
    unattended_install: true
MinimumVersion: 0.2.0
ParentRecipe: com.github.autopkg.download.googlechrome
Process:
- Processor: MunkiImporter
  Arguments:
    pkg_path: '%pathname%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
