# Downloaded from https://github.com/autopkg/recipes/blob/4aa2d9380d7f8ba54af95915c8c47a73fcf88acf/GoogleChrome/GoogleChrome.download.recipe
# Commit: 4aa2d9380d7f8ba54af95915c8c47a73fcf88acf
# Downloaded at: 2025-11-27 22:27:43 UTC

Description: Downloads latest Google Chrome disk image.
Identifier: com.github.autopkg.download.googlechrome
Input:
  NAME: GoogleChrome
  DOWNLOAD_URL: https://dl.google.com/chrome/mac/universal/stable/GGRO/googlechrome.dmg
MinimumVersion: 0.3.1
Process:
- Processor: URLDownloader
  Arguments:
    url: '%DOWNLOAD_URL%'
    filename: '%NAME%.dmg'
- Processor: EndOfCheckPhase
- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%pathname%/Google Chrome.app'
    strict_verification: false
    requirement: (identifier "com.google.Chrome" or identifier "com.google.Chrome.beta" or identifier "com.google.Chrome.dev" or identifier "com.google.Chrome.canary") and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = EQHXZ8M8AV
