# Downloaded from https://github.com/autopkg/recipes/blob/4b5a199119b507053f074f17d7955f1f21f612f0/GoogleChrome/GoogleChromePkg.download.recipe
# Commit: 4b5a199119b507053f074f17d7955f1f21f612f0
# Downloaded at: 2026-02-21 05:58:30 UTC

Description: Downloads latest Google Chrome enterprise package.
Identifier: com.github.autopkg.download.googlechromepkg
Input:
  NAME: GoogleChrome
  DOWNLOAD_URL: https://dl.google.com/chrome/mac/stable/accept_tos%3Dhttps%253A%252F%252Fwww.google.com%252Fintl%252Fen_ph%252Fchrome%252Fterms%252F%26_and_accept_tos%3Dhttps%253A%252F%252Fpolicies.google.com%252Fterms/googlechrome.pkg
MinimumVersion: 1.4.1
Process:
- Processor: URLDownloader
  Arguments:
    url: '%DOWNLOAD_URL%'
    filename: GoogleChrome.pkg
- Processor: EndOfCheckPhase
- Processor: CodeSignatureVerifier
  Arguments:
    expected_authority_names:
    - 'Developer ID Installer: Google LLC (EQHXZ8M8AV)'
    - Developer ID Certification Authority
    - Apple Root CA
    input_path: '%pathname%'
