# Downloaded from https://github.com/autopkg/recipes/blob/4aa2d9380d7f8ba54af95915c8c47a73fcf88acf/GoogleChrome/GoogleChromePkg.pkg.recipe
# Commit: 4aa2d9380d7f8ba54af95915c8c47a73fcf88acf
# Downloaded at: 2025-11-27 22:27:43 UTC

Description: Downloads latest Google Chrome enterprise package and renames it based on the Chrome version.
Identifier: com.github.autopkg.pkg.googlechromepkg
Input:
  NAME: GoogleChrome
MinimumVersion: 1.4.1
ParentRecipe: com.github.autopkg.download.googlechromepkg
Process:
- Processor: FlatPkgUnpacker
  Arguments:
    flat_pkg_path: '%pathname%'
    destination_path: '%RECIPE_CACHE_DIR%/unpack'
- Processor: PkgPayloadUnpacker
  Arguments:
    pkg_payload_path: '%RECIPE_CACHE_DIR%/unpack/GoogleChrome.pkg/Payload'
    destination_path: '%RECIPE_CACHE_DIR%/unpack'
- Processor: PlistReader
  Arguments:
    info_path: '%RECIPE_CACHE_DIR%/unpack/Google Chrome.app'
- Processor: PkgCopier
  Arguments:
    source_pkg: '%pathname%'
    pkg_path: '%RECIPE_CACHE_DIR%/GoogleChrome-%version%.pkg'
- Processor: PathDeleter
  Arguments:
    path_list:
    - '%RECIPE_CACHE_DIR%/unpack'
