# Downloaded from https://github.com/autopkg/jc0b-recipes/blob/b4e4e63fffb5609ba8a82236dcfbdb1d75c83aea/Jamf/JamfComplianceEditor.munki.recipe.yaml
# Commit: b4e4e63fffb5609ba8a82236dcfbdb1d75c83aea
# Downloaded at: 2026-02-22 01:45:56 UTC

Identifier: com.github.jc0b.munki.JamfComplianceEditor
Description: >
  Downloads the Jamf Compliance Editor app from Jamf's site,
  and imports into Munki repository.
MinimumVersion: "2.3"
ParentRecipe: com.github.grahampugh.recipes.pkg.JamfComplianceEditor

Input:
  NAME: "JamfComplianceEditor"
  DISPLAY_NAME: "Jamf Compliance Editor"
  MUNKI_REPO_SUBDIR: "apps/Jamf"
  pkginfo:
    catalogs:
      - testing
    description: >
      Jamf Compliance Editor is a tool that provides macOS,
      iOS/iPadOS system administrators with an easy way to
      establish and manage compliance baselines on their
      fleet of Apple devices.
    display_name: "%DISPLAY_NAME%"
    name: "%NAME%"

Process:
  - Processor: MunkiImporter
    Arguments:
      pkg_path: "%pkg_path%"
      repo_subdirectory: "%MUNKI_REPO_SUBDIR%"