# Downloaded from https://github.com/autopkg/gerardkok-recipes/blob/fba95dd24e8408ba08f9d74cb5f82468883691fa/Node.js/node.munki.recipe
# Commit: fba95dd24e8408ba08f9d74cb5f82468883691fa
# Downloaded at: 2025-11-27 22:28:38 UTC

Description: Downloads Node.js and imports into Munki.
Identifier: com.github.gerardkok.munki.node
Input:
  MUNKI_REPO_SUBDIR: apps/Node.js
  MUNKI_CATEGORY: Development
  NAME: node
  RELEASE: latest-dubnium
  DISPLAY_NAME: Node.js
  pkginfo:
    catalogs:
    - testing
    blocking_applications:
    - node
    - npm
    category: '%MUNKI_CATEGORY%'
    description: "Node.js\xAE is a platform built on Chrome's JavaScript runtime for easily building fast, scalable network applications."
    developer: Node.js Foundation
    display_name: '%DISPLAY_NAME%'
    name: '%NAME%'
    unattended_install: true
MinimumVersion: 0.6.0
ParentRecipe: com.github.gerardkok.download.node
Process:
- Processor: MunkiImporter
  Arguments:
    pkg_path: '%pathname%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
