# Downloaded from https://github.com/autopkg/gerardkok-recipes/blob/fba95dd24e8408ba08f9d74cb5f82468883691fa/Node.js/node.install.recipe
# Commit: fba95dd24e8408ba08f9d74cb5f82468883691fa
# Downloaded at: 2025-11-27 22:28:38 UTC

Description: Downloads, verifies and installs the latest version of Node.js.
Identifier: com.github.gerardkok.install.node
Input:
  NAME: node
MinimumVersion: 0.4.0
ParentRecipe: com.github.gerardkok.download.node
Process:
- Processor: Installer
  Arguments:
    pkg_path: '%pathname%'
