Description: Obtain upstream Jamf recipe from autopkg/jc0b-recipes

Identifier: com.github.anywhereops.vendorer.Jamf

MinimumVersion: '2.3'

Input: {}

Process:
  - Processor: AutopkgVendorer
    Arguments:
      github_repo: autopkg/jc0b-recipes
      folder_path: Jamf
      commit_sha: b4e4e63fffb5609ba8a82236dcfbdb1d75c83aea
      destination_path: Jamf
      recipe_type: munki
