Description: Obtain upstream MicrosoftOneDrive recipe from autopkg/rtrouton-recipes

Identifier: com.github.anywhereops.vendorer.MicrosoftOneDrive

MinimumVersion: '2.3'

Input: {}

Process:
  - Processor: AutopkgVendorer
    Arguments:
      github_repo: autopkg/rtrouton-recipes
      folder_path: MicrosoftOneDrive
      commit_sha: 7d4886a0c21b4990c2fe43b23bcaaf8477363734
      destination_path: MicrosoftOneDrive
      recipe_type: munki
      required_license: MIT
