Description: Obtain upstream NordVPN recipe from autopkg/dataJAR-recipes

Identifier: com.github.anywhereops.vendorer.NordVPN

MinimumVersion: '2.3'

Input: {}

Process:
  - Processor: AutopkgVendorer
    Arguments:
      github_repo: autopkg/dataJAR-recipes
      folder_path: NordVPN
      commit_sha: 4e1be9dc49c30ad4b1ccdd3d0b090522684032e6
      destination_path: NordVPN
      recipe_type: munki
      required_license: Apache-2.0
