Description: Obtain upstream Okta Verify recipe from autopkg/nstrauss-recipes

Identifier: com.github.anywhereops.vendorer.OktaVerify

MinimumVersion: '2.3'

Input: {}

Process:
  - Processor: AutopkgVendorer
    Arguments:
      github_repo: autopkg/nstrauss-recipes
      folder_path: Okta Verify
      commit_sha: e58bfac92f1739258afd8cf246d148e1b60fd986
      destination_path: Okta Verify
      recipe_type: munki
