Description: Obtain Shared Processors from MLBZ521's repo

Identifier: com.github.anywhereops.vendorer.SharedProcessorsMLBZ521

MinimumVersion: '2.3'

Input: {}

Process:
  - Processor: AutopkgVendorer
    Arguments:
      github_repo: autopkg/MLBZ521-recipes
      folder_path: Shared Processors
      commit_sha: 8b7738eed4c2f8b6b32a897907ee3420fa0c74ef
      destination_path: SharedProcessors-MLBZ521
      required_license: MIT
