Description: Obtain Shared Processors from homebysix's repo

Identifier: com.github.anywhereops.vendorer.SharedProcessorshomebysix

MinimumVersion: '2.3'

Input: {}

Process:
  - Processor: AutopkgVendorer
    Arguments:
      github_repo: autopkg/homebysix-recipes
      folder_path: VersionSplitter
      commit_sha: 26f97759822c6c90b8f458f35b82ff9496785c71
      destination_path: SharedProcessors-homebysix
      required_license: Apache-2.0
