Description: Obtain Shared Processors from n8felton's repo

Identifier: com.github.anywhereops.vendorer.SharedProcessorsn8felton

MinimumVersion: '2.3'

Input: {}

Process:
  - Processor: AutopkgVendorer
    Arguments:
      github_repo: autopkg/n8felton-recipes
      folder_path: SharedProcessors
      commit_sha: 646d469b0e6e964e0605774d8541ce29912b9207
      destination_path: SharedProcessors-n8felton
