Description: Obtain Shared Processors from timsutton's repo

Identifier: com.github.anywhereops.vendorer.SharedProcessorstimsutton

MinimumVersion: '2.3'

Input: {}

Process:
  - Processor: AutopkgVendorer
    Arguments:
      github_repo: autopkg/timsutton-recipes
      folder_path: Blackmagic
      commit_sha: 9193e16e06f78c6e9692955c13737c8b5e6e56a6
      destination_path: SharedProcessors-timsutton
