Description: Obtain Shared Processors from smithjw's repo

Identifier: com.github.anywhereops.vendorer.SharedProcessorssmithjw

MinimumVersion: '2.3'

Input: {}

Process:
  - Processor: AutopkgVendorer
    Arguments:
      github_repo: autopkg/smithjw-recipes
      folder_path: SharedProcessors
      commit_sha: dba2fa9753a41b934855d0ef9c9bd0489b8b1636
      destination_path: SharedProcessors-smithjw
      required_license: Apache-2.0
