Description: Obtain upstream Zoom recipe from autopkg/homebysix-recipes

Identifier: com.github.anywhereops.vendorer.Zoom

MinimumVersion: '2.3'

Input: {}

Process:
  - Processor: AutopkgVendorer
    Arguments:
      github_repo: autopkg/homebysix-recipes
      folder_path: Zoom
      commit_sha: 72c89c63ec1e18cd8991f2e20038f0c51842ecae
      destination_path: Zoom
      recipe_type: munki
      required_license: Apache-2.0
