# Downloaded from https://github.com/autopkg/recipes/blob/4b5a199119b507053f074f17d7955f1f21f612f0/Spotify/Spotify.munki.recipe
# Commit: 4b5a199119b507053f074f17d7955f1f21f612f0
# Downloaded at: 2026-02-22 01:48:00 UTC

Description: "Downloads the latest Spotify and imports into Munki.\n\nFor Apple Silicon set DOWNLOAD_ARCH to \"ARM64\" and SUPPORTED_ARCH to \"arm64\" (default)\n\nFor Intel leave DOWNLOAD_ARCH empty and set SUPPORTED_ARCH to \"x86_64\"\n\nNote: 1.0.50 and 1.0.51 versions of Spotify has mode 744 for its executables,\ncausing the app to not launch for any user except the user who installed\nit, root in the case of Munki. Currently a postinstall_script fixes this issue\nby adding group and owner +x to these files.\n\nRelated GitHub issue:\nhttps://github.com/autopkg/recipes/issues/196\n"
Identifier: com.github.autopkg.munki.Spotify
Input:
  NAME: Spotify
  MUNKI_REPO_SUBDIR: apps
  pkginfo:
    catalogs:
    - testing
    description: Spotify is a music streaming service offering unlimited streaming of selected music from a range of major and independent record labels.
    display_name: Spotify
    name: '%NAME%'
    postinstall_script: "#!/bin/bash\n                # Add directory traversal for the entire application and ensure \n                # all executables are executable by group and other\n                /bin/chmod -R go+rX /Applications/Spotify.app\n            "
    supported_architectures:
    - '%SUPPORTED_ARCH%'
    unattended_install: true
MinimumVersion: 0.2.0
ParentRecipe: com.github.autopkg.download.Spotify
Process:
- Processor: MunkiImporter
  Arguments:
    pkg_path: '%pathname%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
