# Downloaded from https://github.com/autopkg/mosen-recipes/blob/908662c062d02ff949d672eb5ff3234dc69a10e4/SaltStack/salt-py3.download.recipe
# Commit: 908662c062d02ff949d672eb5ff3234dc69a10e4
# Downloaded at: 2026-02-21 05:59:21 UTC

Description: Downloads the latest python3 version of SaltStack.
Identifier: com.github.mosen.download.salt.py3
Input:
  NAME: Salt
MinimumVersion: 0.2.0
Process:
- Processor: DeprecationWarning
  Arguments:
    warning_message: 'The Salt Project is no longer building macOS packages (details: https://saltproject.io/blog/streamlining-cicd-package-distribution/). This recipe is deprecated and will be removed in the future.'
- Processor: URLTextSearcher
  Arguments:
    url: https://repo.saltstack.com/#osx
    re_pattern: osx\/salt\-([\d\.\\-]+)\-py3-x86_64.pkg
    result_output_var_name: version
- Processor: URLDownloader
  Arguments:
    url: https://repo.saltstack.com/osx/salt-%version%-py3-x86_64.pkg
- Processor: EndOfCheckPhase
