# Downloaded from https://github.com/autopkg/mosen-recipes/blob/908662c062d02ff949d672eb5ff3234dc69a10e4/SaltStack/salt.download.recipe
# Commit: 908662c062d02ff949d672eb5ff3234dc69a10e4
# Downloaded at: 2026-02-22 01:50:18 UTC

Description: "Downloads the latest version of SaltStack, specify python version\nin the PYVERSION variable to switch between 2 (default) and 3 versions of the installer."
Identifier: com.github.mosen.download.salt
Input:
  NAME: Salt
  PYVERSION: '2'
MinimumVersion: 0.5.0
Process:
- Processor: DeprecationWarning
  Arguments:
    warning_message: 'The Salt Project is no longer building macOS packages (details: https://saltproject.io/blog/streamlining-cicd-package-distribution/). This recipe is deprecated and will be removed in the future.'
- Processor: URLTextSearcher
  Arguments:
    url: https://repo.saltstack.com/#osx
    re_pattern: 'Latest release: ([\d\.]+)'
    result_output_var_name: version
- Processor: URLDownloader
  Arguments:
    url: https://repo.saltstack.com/osx/salt-%version%-py%PYVERSION%-x86_64.pkg
- Processor: EndOfCheckPhase
- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%pathname%'
    expected_authority_names:
    - 'Developer ID Installer: Salt Stack, Inc. (VK797BMMY4)'
    - Developer ID Certification Authority
    - Apple Root CA
