# Downloaded from https://github.com/autopkg/rtrouton-recipes/blob/7d4886a0c21b4990c2fe43b23bcaaf8477363734/MicrosoftExcel365/MicrosoftExcel365.munki.recipe
# Commit: 7d4886a0c21b4990c2fe43b23bcaaf8477363734
# Downloaded at: 2026-02-22 01:46:18 UTC

Description: Downloads the latest Microsoft Excel installer package for Office 365 and imports into Munki.
Identifier: com.github.rtrouton.munki.microsoftexcel365
Input:
  NAME: Excel365
  MUNKI_REPO_SUBDIR: apps/msoffice
  pkginfo:
    catalogs:
    - testing
    display_name: Microsoft Excel 365
    name: '%NAME%'
    unattended_install: true
MinimumVersion: 0.2.0
ParentRecipe: com.github.rtrouton.download.microsoftexcel365
Process:
- Processor: FlatPkgUnpacker
  Arguments:
    flat_pkg_path: '%pathname%'
    destination_path: '%RECIPE_CACHE_DIR%/pkg_unpack'
    purge_destination: true
- Processor: PkgPayloadUnpacker
  Arguments:
    pkg_payload_path: '%RECIPE_CACHE_DIR%/pkg_unpack/Microsoft_Excel.pkg/Payload'
    destination_path: '%RECIPE_CACHE_DIR%/%NAME%/Applications'
    purge_destination: true
- Processor: MunkiInstallsItemsCreator
  Arguments:
    faux_root: '%RECIPE_CACHE_DIR%/%NAME%/'
    installs_item_paths:
    - /Applications/Microsoft Excel.app
- Processor: MunkiPkginfoMerger
- Processor: MunkiImporter
  Arguments:
    pkg_path: '%pathname%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
