# Downloaded from https://github.com/autopkg/wegotoeleven-recipes/blob/04ea6e664cd93cded2563ec8aecc31c52eddb424/Logitech/LogiBolt.pkg.recipe.yaml
# Commit: 04ea6e664cd93cded2563ec8aecc31c52eddb424
# Downloaded at: 2026-02-22 01:46:05 UTC

Description: Downloads the latest version of the Logi Bolt installer app, and creates a package. This package deploys
  the installer to /tmp in then installs the app silently.
Identifier: com.github.wegotoeleven-recipes.pkg.LogiBolt
MinimumVersion: '2.3'
ParentRecipe: com.github.wegotoeleven-recipes.download.LogiBolt

Input:
  NAME: Logi Bolt
  URL: https://download01.logi.com/web/ftp/pub/techsupport/logibolt/LogiBoltInstaller.zip

Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        scripts: "0755"
        root: "0755"
        root/private: "0755"
        root/private/tmp: "0777"
      pkgroot: "%RECIPE_CACHE_DIR%/pkg"

  - Processor: FileMover
    Arguments:
      overwrite: false
      source: "%found_filename%"
      target: "%RECIPE_CACHE_DIR%/pkg/root/private/tmp/logibolt.app"

  - Processor: FileCreator
    Arguments:
      file_path: "%RECIPE_CACHE_DIR%/pkg/scripts/postinstall"
      file_mode: "0755"
      file_content: |
        #!/bin/zsh

        # Check exit code and bail if the package didn't install correctly
        if [[ -e "/private/tmp/logibolt.app" ]]; then
            if ! "/private/tmp/logibolt.app/Contents/MacOS/Logi Bolt Installer" --silent --launchPostInstall No; then
                echo "Issues occurred during the installation of Logi Bolt. Please check the install log and try again."
                exit 1
            fi
        else
            echo "Unable to find Logi Bolt installer. Bailing..."
            exit 1
        fi

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        id: "%BUNDLE_ID%"
        pkgname: "%NAME%-%version%"
        pkgroot: "%RECIPE_CACHE_DIR%/pkg/root"
        scripts: "%RECIPE_CACHE_DIR%/pkg/scripts"
        version: "%version%"

  - Processor: PathDeleter
    Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/unzip"