# Downloaded from https://github.com/autopkg/nstrauss-recipes/blob/e58bfac92f1739258afd8cf246d148e1b60fd986/OBS/OBS.download.recipe
# Commit: e58bfac92f1739258afd8cf246d148e1b60fd986
# Downloaded at: 2026-02-22 01:47:10 UTC

Description: "Download the latest OBS disk image.\n    For ARCH use \"intel\" for Intel/x86_64 or \"apple\" for ARM/arm64"
Identifier: com.github.nstrauss.download.OBS
Input:
  NAME: OBS
  ARCH: intel
  RE_PATTERN: href="(.*?%ARCH%.dmg)"
  SEARCH_URL: https://obsproject.com/download
MinimumVersion: '1.0'
Process:
- Processor: URLTextSearcher
  Arguments:
    re_pattern: '%RE_PATTERN%'
    result_output_var_name: download_url
    url: '%SEARCH_URL%'
- Processor: URLDownloader
  Arguments:
    url: '%download_url%'
- Processor: EndOfCheckPhase
- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%pathname%/OBS.app'
    requirement: identifier "com.obsproject.obs-studio" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "2MMRE5MTB8"
