# Downloaded from https://github.com/autopkg/nstrauss-recipes/blob/e58bfac92f1739258afd8cf246d148e1b60fd986/OBS/OBS.pkg.recipe
# Commit: e58bfac92f1739258afd8cf246d148e1b60fd986
# Downloaded at: 2026-02-22 01:47:10 UTC

Description: "Download the latest OBS disk image and builds a package.\n    For ARCH use \"intel\" for Intel/x86_64 or \"apple\" for ARM/arm64"
Identifier: com.github.nstrauss.pkg.OBS
Input:
  NAME: OBS
  ARCH: intel
MinimumVersion: '1.0'
ParentRecipe: com.github.nstrauss.download.OBS
Process:
- Processor: Versioner
  Arguments:
    input_plist_path: '%pathname%/OBS.app/Contents/Info.plist'
    plist_version_key: CFBundleShortVersionString
- Processor: AppPkgCreator
  Arguments:
    pkg_path: '%RECIPE_CACHE_DIR%/OBS-%ARCH%-%version%.pkg'
