# Downloaded from https://github.com/autopkg/joshua-d-miller-recipes/blob/8a1767feebc676e376cc661d05f092c654217ce1/OBS/OBS.munki.recipe
# Commit: 8a1767feebc676e376cc661d05f092c654217ce1
# Downloaded at: 2026-02-22 01:47:08 UTC

Description: Downloads the latest version of OBS Studio and imports it into Munki.
Identifier: com.github.joshua-d-miller.autopkg.munki.OBS
Input:
  MUNKI_REPO_SUBDIR: apps/obs
  NAME: Open Broadcaster Software
  pkginfo:
    catalogs:
    - testing
    description: Free and open source software for video recording and live streaming. Download and start streaming quickly and easily on Windows, Mac or Linux.
    developer: Hugh Bailey
    display_name: Open Broadcaster Software
    name: '%NAME%'
    category: Multimedia
    unattended_install: true
    postinstall_script: "#!/bin/sh\n# copy virtual camera plug-in to its needed location to avoid an admin\n# credentials prompt when starting the virtual camera for the first time\n/bin/cp -R /Applications/OBS.app/Contents/Resources/obs-mac-virtualcam.plugin /Library/CoreMediaIO/Plug-Ins/DAL/\n\t\t\t"
    postuninstall_script: "#!/bin/sh\n# remove virtual camera plug-in\n/bin/rm -r /Library/CoreMediaIO/Plug-Ins/DAL/obs-mac-virtualcam.plugin\n\t\t"
MinimumVersion: '1.0'
ParentRecipe: com.github.nstrauss.download.OBS
Process:
- Processor: MunkiImporter
  Arguments:
    pkg_path: '%pathname%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
