Identifier: local.munki.1Password
Input:
  MUNKI_REPO_SUBDIR: apps/%NAME%
  NAME: 1Password
  pkginfo:
    blocking_applications:
    - 1Password Browser Helper.app
    - 1Password Helper (Renderer).app
    - 1Password Helper (GPU).app
    - 1Password Launcher.app
    - 1Password Helper (Plugin).app
    - 1Password Updater.app
    - 1Password.app
    - 1Password Helper.app
    catalogs:
    - testing
    description: "The world\u2019s most-loved password manager\n\n1Password is the\
      \ easiest way to store and use strong passwords. Log in to sites and fill forms\
      \ securely with a single click."
    developer: AgileBits Inc.
    display_name: 1Password
    name: '%NAME%'
    unattended_install: true
    unattended_uninstall: true
ParentRecipe: com.github.dataJAR-recipes.munki.1Password
ParentRecipeTrustInfo:
  non_core_processors: {}
  parent_recipes:
    com.github.dataJAR-recipes.download.1Password:
      git_hash: 1917dc41972756232b48e2152f301708a1355f6b
      path: AutoPkg/Recipes/1Password/1Password.download.recipe.yaml
      sha256_hash: 9db88fa090b0cf38988d183c6bfa81df602acfba05e94cd1d1ac52954f8128dc
    com.github.dataJAR-recipes.munki.1Password:
      git_hash: 1917dc41972756232b48e2152f301708a1355f6b
      path: AutoPkg/Recipes/1Password/1Password.munki.recipe.yaml
      sha256_hash: 57ef8d56822231f1187bf6ba030c189cd1015ec51e7c76b0002e20396da0485f
