Identifier: local.munki.Apparency
Input:
  NAME: Apparency
  PKG_URL: https://www.mothersruin.com/software/downloads/Apparency.dmg
  pkginfo:
    catalogs:
    - testing
    category: Utilities
    description: Aparency is an application for inspecting other applications.
    developer: Mothers Ruin Software
    display_name: Apparency
    icon_name: Apparency.png
    name: '%NAME%'
    unattended_install: true
    unattended_uninstall: true
    uninstallable: true
  repo_subdirectory: utilities
ParentRecipe: com.github.kevinmcox.munki.Apparency
ParentRecipeTrustInfo:
  non_core_processors: {}
  parent_recipes:
    com.github.kevinmcox.download.Apparency:
      path: /Users/runner/work/lambopkg/lambopkg/AutoPkg/Recipes/Mothers Ruin Software/Apparency.download.recipe.yaml
      sha256_hash: 57eb4ab58ce0d1fdcb1bdf67b2ebddcea2a8831b1bf140eda9b768983bd7cbeb
    com.github.kevinmcox.munki.Apparency:
      path: /Users/runner/work/lambopkg/lambopkg/AutoPkg/Recipes/Mothers Ruin Software/Apparency.munki.recipe.yaml
      sha256_hash: bc15a1f4243c635ea0b63e38b48f66d7af616a1d1e1f3d817799c342065d0d96
