Identifier: local.download.Dedoose
Input:
  NAME: Dedoose
  SEARCH_PATTERN: (?P<url_match>https:\/\/downloads.*Dedoose-(?P<version>[0-9]{1,3}.[0-9]{1,3}.[0-9]{1,3}).dmg)"
  SEARCH_URL: https://www.dedoose.com/resources/articledetail/dedoose-desktop-app
ParentRecipe: com.github.rustymyers.download.Dedoose
ParentRecipeTrustInfo:
  non_core_processors: {}
  parent_recipes:
    com.github.rustymyers.download.Dedoose:
      git_hash: 1917dc41972756232b48e2152f301708a1355f6b
      path: AutoPkg/Recipes/Dedoose/Dedoose.download.recipe.yaml
      sha256_hash: 95c7127ca1bf5dd57400fd995ef28ee03ab5b13775dc81ec296641199526bc51
