Identifier: local.munki.Elgato Camera Hub
Input:
  DERIVE_MIN_OS: true
  MUNKI_REPO_SUBDIR: apps/%NAME%
  NAME: ElgatoCameraHub
  pkginfo:
    blocking_applications:
    - QtWebEngineProcess.app
    - Camera Hub.app
    catalogs:
    - testing
    description: "Unleash your webcam\u2019s full potential."
    developer: Corsair Memory, Inc.
    display_name: Camera Hub
    name: '%NAME%'
    unattended_install: true
    uninstall_method: uninstall_script
    uninstall_script: '#!/bin/bash


      # This uninstall script is taken from the Elagto Stream Deck Uninstaller Package:

      # https://help.elgato.com/hc/en-us/articles/4420177682189-Elgato-Camera-Hub-Uninstall-Procedure-on-macOS


      # kill process

      /usr/bin/killall "Camera Hub" > /dev/null 2>&1 || :


      # remove app. bundle

      /bin/rm -rf "/Applications/Camera Hub.app"

      /bin/rm -rf "/Applications/Elgato Camera Hub.app"


      # remove support files

      /bin/rm -rf /Library/Application\ Support/Elgato/Camera\ Hub


      exit 0'
ParentRecipe: com.github.dataJAR-recipes.munki.Elgato Camera Hub
ParentRecipeTrustInfo:
  non_core_processors:
    com.github.grahampugh.recipes.commonprocessors/ChangeModeOwner:
      git_hash: 1917dc41972756232b48e2152f301708a1355f6b
      path: AutoPkg/Recipes/SharedProcessors-grahampugh/ChangeModeOwner.py
      sha256_hash: f27cbc43e0168a703a9bebc47655c4334084efa5114be73efc119136a47bb46d
  parent_recipes:
    com.github.dataJAR-recipes.download.Elgato Camera Hub:
      git_hash: 1917dc41972756232b48e2152f301708a1355f6b
      path: AutoPkg/Recipes/Elgato Camera Hub/Elgato Camera Hub.download.recipe.yaml
      sha256_hash: 98143ad0c4ced550ed9d576bd8d42fde661099122d907d1d85ef231ef1c7c6ae
    com.github.dataJAR-recipes.munki.Elgato Camera Hub:
      git_hash: 1917dc41972756232b48e2152f301708a1355f6b
      path: AutoPkg/Recipes/Elgato Camera Hub/Elgato Camera Hub.munki.recipe.yaml
      sha256_hash: 5c5c7a52e5b88fe80cfc3498b7aed6d94cb9a5136ffee37243beda5eff44d4a9
