Identifier: local.munki.fleetctl
Input:
  MUNKI_REPO_SUBDIR: apps/fleetctl
  NAME: fleetctl
  PKGID: com.fleetdm.fleetctl
  pkginfo:
    catalogs:
    - testing
    description: 'fleetctl (pronounced "Fleet control") is a command line interface
      (CLI) tool for managing Fleet from the command line. fleetctl enables a GitOps
      workflow with Fleet. fleetctl also provides a quick way to work with all the
      data exposed by Fleet without having to use the Fleet UI or work directly with
      the Fleet API.

      '
    display_name: '%NAME%'
    minimum_os_version: '12.0'
    name: '%NAME%'
    version_script: |
      #!/bin/sh
      /usr/local/bin/fleetctl --version | /usr/bin/awk '/^fleetctl/{print $4}'
ParentRecipe: com.github.jc0b.munki.fleetctl
ParentRecipeTrustInfo:
  non_core_processors:
    FindAndReplace:
      path: ''
      sha256_hash: PROCESSOR FILEPATH NOT FOUND
  parent_recipes:
    com.github.jc0b.download.fleetctl:
      path: ~/anywhereops/infra/lambo-pkg/AutoPkg/Recipes/Fleet/fleetctl.download.recipe.yaml
      sha256_hash: d5f17feb26293c04743b60d77fb264e89bca05a1390dea843d6df78c5c96c41d
    com.github.jc0b.munki.fleetctl:
      path: ~/anywhereops/infra/lambo-pkg/AutoPkg/Recipes/Fleet/fleetctl.munki.recipe.yaml
      sha256_hash: ee5cfe382afe5015762dce5b8d8be98a7bcdfffafa59b826c0ad3cc0c00b2899
    com.github.jc0b.pkg.fleetctl:
      path: ~/anywhereops/infra/lambo-pkg/AutoPkg/Recipes/Fleet/fleetctl.pkg.recipe.yaml
      sha256_hash: 1091643c29e0b7508311e886b5b84dca1ced460ea7a9c886a21a88ace7dc9dfd
