Identifier: local.munki.fleetd
Input:
  MUNKI_REPO_SUBDIR: Fleet/fleetd
  NAME: fleetd
  pkginfo:
    catalogs:
    - testing
    category: Management
    description: fleetd is a monitoring agent leveraging osquery.
    developer: Fleet Device Management, Inc.
    display_name: Fleet
    icon_name: fleet.png
    installcheck_script: |
      #!/bin/zsh

      MIN_VERSION="%MINVER%"

      PLIST="/Library/LaunchDaemons/com.fleetdm.orbit.plist"
      ORBIT="/opt/orbit/bin/orbit/macos/stable/orbit"
      OSQUERY="/opt/orbit/bin/osqueryd/macos-app/stable/osquery.app/Contents/MacOS/osqueryd"

      # Make sure the files are present
      if [[ ! -x "${ORBIT}" ]]; then
        echo "orbit is missing or not executable"
        exit 0
      fi

      if [[ ! -x "${OSQUERY}" ]]; then
        echo "osqueryd is missing or not executable"
        exit 0
      fi

      if [[ ! -f "${PLIST}" ]]; then
        echo "LaunchDaemon is missing"
        exit 0
      fi

      # Orbit version check (installed >= expected)
      INSTALLED_VERSION=$("${ORBIT}" --version | /usr/bin/awk '{print $2}')

      autoload -Uz is-at-least
      if ! is-at-least "${MIN_VERSION}" "${INSTALLED_VERSION}"; then
        echo "orbit ${INSTALLED_VERSION} is out of date"
        exit 0
      fi

      # launchd running
      LABEL=$(/usr/libexec/PlistBuddy -c "Print :Label" "${PLIST}" 2>/dev/null || basename "${PLIST}" .plist)

      if ! /bin/launchctl print system/"${LABEL}" 2>/dev/null | /usr/bin/grep -q "state = running"; then
        echo "LaunchDaemon is not running"
        exit 0
      fi

      # No installation needed
      exit 1
    minimum_os_version: '10.15'
    name: '%NAME%'
    unattended_install: true
    unattended_uninstall: true
    uninstall_method: uninstall_script
    uninstall_script: |
      #!/bin/sh
      # BASED ON THE OFFICIAL FLEET SCRIPT REFERENCED BELOW
      # https://fleetdm.com/guides/how-to-uninstall-fleetd
      # https://github.com/fleetdm/fleet/blob/main/it-and-security/lib/macos/scripts/uninstall-fleetd-macos.sh

      /bin/launchctl stop com.fleetdm.orbit
      /bin/launchctl unload /Library/LaunchDaemons/com.fleetdm.orbit.plist
      /usr/bin/pkill fleet-desktop || true
      /bin/rm -rf /Library/LaunchDaemons/com.fleetdm.orbit.plist \
        /var/lib/orbit \
        /usr/local/bin/orbit \
        /var/log/orbit \
        /opt/orbit/
      /usr/sbin/pkgutil --forget com.fleetdm.orbit.base.pkg || true
ParentRecipe: com.github.kevinmcox.munki.fleetd
ParentRecipeTrustInfo:
  non_core_processors: {}
  parent_recipes:
    com.github.kevinmcox.munki.fleetd:
      path: ~/anywhereops/infra/lambo-pkg/AutoPkg/Recipes/Fleet/fleetd.munki.recipe.yaml
      sha256_hash: 4ead230250a1cd80ca4da8d990583dee6234524f67ca351da1f3a1e8f2df46b9
