Identifier: local.munki.fleetctl
Input:
  MUNKI_REPO_SUBDIR: apps/fleetctl
  NAME: fleetctl
  PKGID: com.fleetdm.fleetctl
  pkginfo:
    catalogs:
    - testing
    description: 'fleetctl (pronounced "Fleet control") is a command line interface
      (CLI) tool for managing Fleet from the command line. fleetctl enables a GitOps
      workflow with Fleet. fleetctl also provides a quick way to work with all the
      data exposed by Fleet without having to use the Fleet UI or work directly with
      the Fleet API.

      '
    display_name: '%NAME%'
    minimum_os_version: '12.0'
    name: '%NAME%'
    version_script: |
      #!/bin/sh
      /usr/local/bin/fleetctl --version | /usr/bin/awk '/^fleetctl/{print $4}'
ParentRecipe: com.github.jc0b.munki.fleetctl
ParentRecipeTrustInfo:
  non_core_processors: {}
  parent_recipes:
    com.github.jc0b.download.fleetctl:
      git_hash: 0dd23058ab268bf7a81a18a6d56cf061676b3fa4
      path: ~/work/lambo-pkg/lambo-pkg/AutoPkg/Recipes/Fleet/fleetctl.download.recipe.yaml
      sha256_hash: 983ed9200ffaef26656a73dbb4f271c8c652f45dcab5760975c1c6524d16791b
    com.github.jc0b.munki.fleetctl:
      git_hash: 0dd23058ab268bf7a81a18a6d56cf061676b3fa4
      path: ~/work/lambo-pkg/lambo-pkg/AutoPkg/Recipes/Fleet/fleetctl.munki.recipe.yaml
      sha256_hash: bff072f405d379f28236c90178fbb54d61707e56fd0fec4e8bb7b531c9a40ccb
    com.github.jc0b.pkg.fleetctl:
      git_hash: 0dd23058ab268bf7a81a18a6d56cf061676b3fa4
      path: ~/work/lambo-pkg/lambo-pkg/AutoPkg/Recipes/Fleet/fleetctl.pkg.recipe.yaml
      sha256_hash: ec475488fdc4a4561cf34908d4b8eb5482950ef4b86806e73c418b8a85e33506
