Identifier: local.munki.GitHubDesktop
Input:
  BUILD: darwin
  MUNKI_REPO_SUBDIR: apps/GitHub
  NAME: GitHub Desktop
  pkginfo:
    catalogs:
    - testing
    description: Desktop app made by GitHub for seamless contribution to git projects.
    developer: GitHub, Inc.
    display_name: GitHub Desktop
    name: '%NAME%'
    postinstall_script: "#!/bin/bash\n\nDEST_DIR=\"/usr/local/bin\"\n\nif [[ ! -d\
      \ \"$DEST_DIR\" ]]; then\n    mkdir -p \"$DEST_DIR\"\nfi\n\nln -s \"/Applications/GitHub\
      \ Desktop.app/Contents/Resources/app/static/github.sh\" \"$DEST_DIR/github\"\
      \n\nexit 0\n"
    preinstall_script: "#!/bin/bash\n\nDEST_DIR=\"/usr/local/bin\"\n\n# Remove old\
      \ symbolic links associated with pre-Electron version of GitHub Desktop.\nif\
      \ [[ -L \"$DEST_DIR/git-lfs\" ]]; then\n    rm -f \"$DEST_DIR/git-lfs\"\nfi\n\
      \nexit 0\n"
    unattended_install: true
    unattended_uninstall: true
ParentRecipe: com.github.homebysix.munki.GitHubDesktop
ParentRecipeTrustInfo:
  non_core_processors: {}
  parent_recipes:
    com.github.homebysix.download.GitHubDesktop:
      path: /Users/runner/work/lambopkg/lambopkg/AutoPkg/Recipes/GitHub/GitHubDesktop.download.recipe.yaml
      sha256_hash: a471f508c4a9a3303404cdf45e96bc89a21b0ad34a7f0be0b856b341e3a4a3bb
    com.github.homebysix.munki.GitHubDesktop:
      path: /Users/runner/work/lambopkg/lambopkg/AutoPkg/Recipes/GitHub/GitHubDesktop.munki.recipe.yaml
      sha256_hash: b8b2c83f858c7a242bcb4dceafc11436f99f13434dbda4ab9ddd4256b51b6902
