Identifier: local.munki.GoogleChromePkg
Input:
  DERIVE_MIN_OS: true
  DOWNLOAD_URL: https://dl.google.com/chrome/mac/stable/accept_tos%3Dhttps%253A%252F%252Fwww.google.com%252Fintl%252Fen_ph%252Fchrome%252Fterms%252F%26_and_accept_tos%3Dhttps%253A%252F%252Fpolicies.google.com%252Fterms/googlechrome.pkg
  MUNKI_REPO_SUBDIR: apps/Google
  NAME: GoogleChrome
  pkginfo:
    blocking_applications:
    - Google Chrome
    catalogs:
    - testing
    description: Chrome is a fast, simple, and secure web browser, built for the modern
      web.
    developer: Google
    display_name: Google Chrome
    name: '%NAME%'
    unattended_install: true
ParentRecipe: com.github.autopkg.munki.googlechromepkg
ParentRecipeTrustInfo:
  non_core_processors: {}
  parent_recipes:
    com.github.autopkg.download.googlechromepkg:
      path: /Users/runner/work/lambopkg/lambopkg/AutoPkg/Recipes/GoogleChrome/GoogleChromePkg.download.recipe.yaml
      sha256_hash: e130fb633c2c3192ded2b69ec730b02e0d08665e9625cda2f1a5f63931867acb
    com.github.autopkg.munki.googlechromepkg:
      path: /Users/runner/work/lambopkg/lambopkg/AutoPkg/Recipes/GoogleChrome/GoogleChromePkg.munki.recipe.yaml
      sha256_hash: 91d99fc89b218f9c79c9c3df7c55b9cb66e2dc8879da557687e6eb62476dee6b
