Identifier: local.munki.GoogleChromePkg
Input:
  DERIVE_MIN_OS: true
  DOWNLOAD_URL: https://dl.google.com/chrome/mac/stable/accept_tos%3Dhttps%253A%252F%252Fwww.google.com%252Fintl%252Fen_ph%252Fchrome%252Fterms%252F%26_and_accept_tos%3Dhttps%253A%252F%252Fpolicies.google.com%252Fterms/googlechrome.pkg
  MUNKI_REPO_SUBDIR: apps/Google
  NAME: GoogleChrome
  pkginfo:
    blocking_applications:
    - Google Chrome
    catalogs:
    - testing
    description: Chrome is a fast, simple, and secure web browser, built for the modern
      web.
    developer: Google
    display_name: Google Chrome
    name: '%NAME%'
    unattended_install: true
ParentRecipe: com.github.autopkg.munki.googlechromepkg
ParentRecipeTrustInfo:
  non_core_processors: {}
  parent_recipes:
    com.github.autopkg.download.googlechromepkg:
      path: ~/anywhereops/infra/lambo-pkg/AutoPkg/Recipes/GoogleChrome/GoogleChromePkg.download.recipe.yaml
      sha256_hash: bf6f2a539acadf37b9fb25681fe177e252933ac9bb437b46155b0dce5504e380
    com.github.autopkg.munki.googlechromepkg:
      path: ~/anywhereops/infra/lambo-pkg/AutoPkg/Recipes/GoogleChrome/GoogleChromePkg.munki.recipe.yaml
      sha256_hash: 22cf6df2c4ae220055a373c52524504f75ce1b0438fbe2833bed026c2da3baae
