Identifier: local.munki.iMazing
Input:
  MAJOR_VERSION: '2'
  MUNKI_REPO_SUBDIR: apps/%NAME%
  NAME: iMazing
  pkginfo:
    catalogs:
    - testing
    description: iOS device manager.
    developer: DigiDNA, SARL
    display_name: iMazing
    name: '%NAME%'
    unattended_install: true
    unattended_uninstall: true
ParentRecipe: com.github.homebysix.munki.iMazing
ParentRecipeTrustInfo:
  non_core_processors: {}
  parent_recipes:
    com.github.homebysix.download.iMazing:
      path: ~/anywhereops/infra/lambo-pkg/AutoPkg/Recipes/iMazing/iMazing.download.recipe.yaml
      sha256_hash: ada2ed0df30b475157e19dfa798538943f98b71acb96e71a235204160eea8fd2
    com.github.homebysix.munki.iMazing:
      path: ~/anywhereops/infra/lambo-pkg/AutoPkg/Recipes/iMazing/iMazing.munki.recipe.yaml
      sha256_hash: 84661cb21a4e67b3840f56da138d676352b9da1c9873964c4db731bb4e71db1c
