Identifier: local.munki.JamfComplianceEditor
Input:
  DISPLAY_NAME: Jamf Compliance Editor
  MUNKI_REPO_SUBDIR: apps/Jamf
  NAME: JamfComplianceEditor
  pkginfo:
    catalogs:
    - testing
    description: 'Jamf Compliance Editor is a tool that provides macOS, iOS/iPadOS
      system administrators with an easy way to establish and manage compliance baselines
      on their fleet of Apple devices.

      '
    display_name: '%DISPLAY_NAME%'
    name: '%NAME%'
ParentRecipe: com.github.jc0b.munki.JamfComplianceEditor
ParentRecipeTrustInfo:
  non_core_processors: {}
  parent_recipes:
    com.github.grahampugh.recipes.download.JamfComplianceEditor:
      git_hash: 0dd23058ab268bf7a81a18a6d56cf061676b3fa4
      path: ~/work/lambo-pkg/lambo-pkg/AutoPkg/Recipes/JamfComplianceEditor/JamfComplianceEditor.download.recipe.yaml
      sha256_hash: e4b5fb31b10c35ec6f14cfc2249b8614484ba78d3b4fc6eee2d7b7033078a179
    com.github.grahampugh.recipes.pkg.JamfComplianceEditor:
      git_hash: 0dd23058ab268bf7a81a18a6d56cf061676b3fa4
      path: ~/work/lambo-pkg/lambo-pkg/AutoPkg/Recipes/JamfComplianceEditor/JamfComplianceEditor.pkg.recipe.yaml
      sha256_hash: 34c502eb8cd087114279989ee95baae8bae6fdf8f86a6f4cbfd19ac3a835bbbf
    com.github.jc0b.munki.JamfComplianceEditor:
      git_hash: 0dd23058ab268bf7a81a18a6d56cf061676b3fa4
      path: ~/work/lambo-pkg/lambo-pkg/AutoPkg/Recipes/Jamf/JamfComplianceEditor.munki.recipe.yaml
      sha256_hash: a697e74ff208c008644fcb4ae0c344e9b9556cab068dbfb1297071d3bcbf6c35
