Identifier: local.munki.Microsoft Azure Storage Explorer
Input:
  DOWNLOADURL: https://go.microsoft.com/fwlink/?linkid=%PRODUCTID%
  MUNKI_REPO_SUBDIR: apps/%NAME%
  NAME: Microsoft Azure Storage Explorer
  PRODUCTID: '2279415'
  SUPPORTED_ARCH: arm64
  pkginfo:
    catalogs:
    - testing
    description: Upload, download, and manage Azure blobs, files, queues, and tables,
      as well as Azure Cosmos DB and Azure Data Lake Storage entities. Easily access
      virtual machine disks, and work with either Azure Resource Manager or classic
      storage accounts. Manage and configure cross-origin resource sharing rules.
    display_name: MicrosoftAzureStorageExplorer
    name: '%NAME%'
    supported_architectures:
    - '%SUPPORTED_ARCH%'
    unattended_install: true
    unattended_uninstall: true
ParentRecipe: com.github.dataJAR-recipes.munki.MicrosoftAzureStorageExplorer
ParentRecipeTrustInfo:
  non_core_processors:
    com.github.grahampugh.recipes.commonprocessors/ChangeModeOwner:
      git_hash: 1917dc41972756232b48e2152f301708a1355f6b
      path: AutoPkg/Recipes/SharedProcessors-grahampugh/ChangeModeOwner.py
      sha256_hash: f27cbc43e0168a703a9bebc47655c4334084efa5114be73efc119136a47bb46d
  parent_recipes:
    com.github.dataJAR-recipes.download.MicrosoftAzureStorageExplorer:
      git_hash: 1917dc41972756232b48e2152f301708a1355f6b
      path: AutoPkg/Recipes/Microsoft Azure Storage Explorer/Microsoft Azure Storage
        Explorer.download.recipe.yaml
      sha256_hash: 0229d9cdb085c0f18042240a0ac588e42d54c4e9ddf281e416c7db7ef4ec6c4d
    com.github.dataJAR-recipes.munki.MicrosoftAzureStorageExplorer:
      git_hash: 1917dc41972756232b48e2152f301708a1355f6b
      path: AutoPkg/Recipes/Microsoft Azure Storage Explorer/Microsoft Azure Storage
        Explorer.munki.recipe.yaml
      sha256_hash: 57a8908ef162bf4dd088c5e57cca7f100c62a7b2415f6f23be329e40efb37014
