Identifier: local.munki.MicrosoftOneDrive
Input:
  DERIVE_MIN_OS: ''
  DOWNLOADURL: https://go.microsoft.com/fwlink/?linkid=%PRODUCTID%
  MUNKI_REPO_SUBDIR: apps/Microsoft
  NAME: MicrosoftOnedrive
  PRODUCTID: '823060'
  SOFTWARETITLE: OneDrive
  VENDOR: Microsoft
  pkginfo:
    catalogs:
    - testing
    category: Productivity
    description: Microsoft Onedrive
    developer: Microsoft
    display_name: Microsoft Onedrive
    name: '%NAME%'
ParentRecipe: com.github.rtrouton.munki.microsoftonedrive
ParentRecipeTrustInfo:
  non_core_processors: {}
  parent_recipes:
    com.github.rtrouton.download.microsoftonedrive:
      git_hash: 0dd23058ab268bf7a81a18a6d56cf061676b3fa4
      path: ~/work/lambo-pkg/lambo-pkg/AutoPkg/Recipes/MicrosoftOneDrive/MicrosoftOneDrive.download.recipe.yaml
      sha256_hash: 37832cd454fefad177d904eaa56322e9abdda866f6c024d9e5a996f8943de544
    com.github.rtrouton.munki.microsoftonedrive:
      git_hash: 0dd23058ab268bf7a81a18a6d56cf061676b3fa4
      path: ~/work/lambo-pkg/lambo-pkg/AutoPkg/Recipes/MicrosoftOneDrive/MicrosoftOneDrive.munki.recipe.yaml
      sha256_hash: e431033f8b7754372912a81da70f1c0b0ab4527e4b4aeb26431945e75626b1f4
