Identifier: local.munki.munkitools
Input:
  INCLUDE_PRERELEASES: ''
  MUNKI_ICON: munkitools.png
  MUNKI_REPO_SUBDIR: munkitools
  NAME: munkitools
  pkginfo:
    catalogs:
    - development
    category: munkitools
    description: Managed software installation for macOS.
    developer: The Munki Project
    display_name: Managed Software Center
    icon_name: '%MUNKI_ICON%'
    minimum_os_version: '10.15'
    name: '%NAME%'
    unattended_install: true
ParentRecipe: com.github.autopkg.munki.munkitools
ParentRecipeTrustInfo:
  non_core_processors: {}
  parent_recipes:
    com.github.autopkg.munki.munkitools:
      path: /Users/runner/work/lambopkg/lambopkg/AutoPkg/Recipes/munkitools/munkitools.munki.recipe.yaml
      sha256_hash: 9f24afd7bcd1c9a81f66544a08eb1892eda22f9be90a414673076c505cf0fe42
