Identifier: local.munki.munkitools
Input:
  INCLUDE_PRERELEASES: ''
  MUNKI_ICON: munkitools.png
  MUNKI_REPO_SUBDIR: munkitools
  NAME: munkitools
  pkginfo:
    catalogs:
    - development
    category: munkitools
    description: Managed software installation for macOS.
    developer: The Munki Project
    display_name: Managed Software Center
    icon_name: '%MUNKI_ICON%'
    minimum_os_version: '10.15'
    name: '%NAME%'
    unattended_install: true
ParentRecipe: com.github.autopkg.munki.munkitools
ParentRecipeTrustInfo:
  non_core_processors: {}
  parent_recipes:
    com.github.autopkg.munki.munkitools:
      path: ~/anywhereops/infra/lambopkg/AutoPkg/Recipes/munkitools/munkitools.munki.recipe.yaml
      sha256_hash: d1812ff76dc2aea8a9c015802a04aaffd892c9df09f16a24cc56dd4e861532e6
