Identifier: local.munki.OktaVerify
Input:
  DERIVE_MIN_OS: true
  MUNKI_CATEGORY: Security
  MUNKI_REPO_SUBDIR: apps/OktaVerify
  NAME: OktaVerify
  OKTA_DOMAIN: okta.com
  OKTA_ORG: ''
  OKTA_RELEASE_CHANNEL: GA
  pkginfo:
    catalogs:
    - testing
    category: '%MUNKI_CATEGORY%'
    description: Okta Verify is a lightweight multifactor authentication app that
      is used to register your device to Okta. Registering your device to Okta gives
      you passwordless authentication to apps, strong device-level security, and more.
    developer: Okta
    display_name: Okta Verify
    name: '%NAME%'
    unattended_install: true
    unattended_uninstall: true
    uninstall_method: uninstall_script
    uninstall_script: "#!/bin/zsh\n/usr/bin/killall \"Okta Verify\"\n/bin/rm -rf \"\
      /Applications/Okta Verify.app\"\npkgutil --forget com.okta.mobile\nexit 0\n\
      \            "
ParentRecipe: com.github.nstrauss.munki.OktaVerify
ParentRecipeTrustInfo:
  non_core_processors: {}
  parent_recipes:
    com.github.nstrauss.download.OktaVerify:
      git_hash: 0dd23058ab268bf7a81a18a6d56cf061676b3fa4
      path: ~/work/lambo-pkg/lambo-pkg/AutoPkg/Recipes/Okta Verify/OktaVerify.download.recipe.yaml
      sha256_hash: 483ec222619d3ca6f9f59f69a7ac3fbd5893756cfd4ef24b511e0c0b4f0ba79b
    com.github.nstrauss.munki.OktaVerify:
      git_hash: 0dd23058ab268bf7a81a18a6d56cf061676b3fa4
      path: ~/work/lambo-pkg/lambo-pkg/AutoPkg/Recipes/Okta Verify/OktaVerify.munki.recipe.yaml
      sha256_hash: d172388e5542787e39f71abccb4bac1470e3f445bafd802802610b90846682f4
    com.github.nstrauss.pkg.OktaVerify:
      git_hash: 0dd23058ab268bf7a81a18a6d56cf061676b3fa4
      path: ~/work/lambo-pkg/lambo-pkg/AutoPkg/Recipes/Okta Verify/OktaVerify.pkg.recipe.yaml
      sha256_hash: d3043bce6ef655b259ee20de464635ebb61584b91f09f53341e404152929c778
