Identifier: local.munki.OktaVerify
Input:
  DERIVE_MIN_OS: true
  MUNKI_CATEGORY: Security
  MUNKI_REPO_SUBDIR: apps/OktaVerify
  NAME: OktaVerify
  OKTA_DOMAIN: okta.com
  OKTA_ORG: ''
  OKTA_RELEASE_CHANNEL: GA
  pkginfo:
    catalogs:
    - testing
    category: '%MUNKI_CATEGORY%'
    description: Okta Verify is a lightweight multifactor authentication app that
      is used to register your device to Okta. Registering your device to Okta gives
      you passwordless authentication to apps, strong device-level security, and more.
    developer: Okta
    display_name: Okta Verify
    name: '%NAME%'
    unattended_install: true
    unattended_uninstall: true
    uninstall_method: uninstall_script
    uninstall_script: "#!/bin/zsh\n/usr/bin/killall \"Okta Verify\"\n/bin/rm -rf \"\
      /Applications/Okta Verify.app\"\npkgutil --forget com.okta.mobile\nexit 0\n\
      \            "
ParentRecipe: com.github.nstrauss.munki.OktaVerify
ParentRecipeTrustInfo:
  non_core_processors: {}
  parent_recipes:
    com.github.nstrauss.download.OktaVerify:
      path: ~/anywhereops/infra/lambo-pkg/AutoPkg/Recipes/Okta Verify/OktaVerify.download.recipe.yaml
      sha256_hash: ab5ece9d3f2f7f2bb53f6793075c691d988cfacd6a65f0471105c6fb44ba9435
    com.github.nstrauss.munki.OktaVerify:
      path: ~/anywhereops/infra/lambo-pkg/AutoPkg/Recipes/Okta Verify/OktaVerify.munki.recipe.yaml
      sha256_hash: cd4ef5f44b549abc33293c5097a598bed2a979990bee403aceafb5847a3e762f
    com.github.nstrauss.pkg.OktaVerify:
      path: ~/anywhereops/infra/lambo-pkg/AutoPkg/Recipes/Okta Verify/OktaVerify.pkg.recipe.yaml
      sha256_hash: cd00ace55d1d9d367b5172976f9a9479161ac14e5b7e9f96c6c89d7c6cf35acd
