Identifier: local.munki.Spotify
Input:
  DOWNLOAD_ARCH: ARM64
  MUNKI_REPO_SUBDIR: apps
  NAME: Spotify
  SUPPORTED_ARCH: arm64
  pkginfo:
    catalogs:
    - testing
    description: Spotify is a music streaming service offering unlimited streaming
      of selected music from a range of major and independent record labels.
    display_name: Spotify
    name: '%NAME%'
    postinstall_script: "#!/bin/bash\n                # Add directory traversal for\
      \ the entire application and ensure \n                # all executables are\
      \ executable by group and other\n                /bin/chmod -R go+rX /Applications/Spotify.app\n\
      \            "
    supported_architectures:
    - '%SUPPORTED_ARCH%'
    unattended_install: true
ParentRecipe: com.github.autopkg.munki.Spotify
ParentRecipeTrustInfo:
  non_core_processors: {}
  parent_recipes:
    com.github.autopkg.download.Spotify:
      git_hash: 0dd23058ab268bf7a81a18a6d56cf061676b3fa4
      path: ~/work/lambo-pkg/lambo-pkg/AutoPkg/Recipes/Spotify/Spotify.download.recipe.yaml
      sha256_hash: 80f243dcb013a665778105eb587e7101e2eefc64110e786d7de1a61ae2016072
    com.github.autopkg.munki.Spotify:
      git_hash: 0dd23058ab268bf7a81a18a6d56cf061676b3fa4
      path: ~/work/lambo-pkg/lambo-pkg/AutoPkg/Recipes/Spotify/Spotify.munki.recipe.yaml
      sha256_hash: 77cd6890b7a8c271054f88d803efa3495a5c0b0d346967ecd9834e05c5ebcb1e
