# Downloaded from https://github.com/autopkg/gregneagle-recipes/blob/39b126a910d3a8d643f63022f2c135bac132a23e/SuspiciousPackageXip/SuspiciousPackageXip.install.recipe
# Commit: 39b126a910d3a8d643f63022f2c135bac132a23e
# Downloaded at: 2026-02-22 01:48:13 UTC

Description: Install recipe for the SuspiciousPackage app xip archive.
Identifier: com.github.gregneagle.install.suspiciouspackagexip
Input:
  NAME: SuspiciousPackage
MinimumVersion: 0.5.3
ParentRecipe: com.github.gregneagle.pkg.suspiciouspackagexip
Process:
- Processor: Installer
