# Downloaded from https://github.com/autopkg/gregneagle-recipes/blob/39b126a910d3a8d643f63022f2c135bac132a23e/SuspiciousPackageXip/SuspiciousPackageXip.download.recipe
# Commit: 39b126a910d3a8d643f63022f2c135bac132a23e
# Downloaded at: 2026-02-22 01:48:13 UTC

Description: "Defunct recipe.\nDownload recipe for the SuspiciousPackage app xip archive.\nRequires a post-0.5.2 version of CodeSignatureVerifier."
Identifier: com.github.gregneagle.download.suspiciouspackagexip
Input:
  NAME: SuspiciousPackage
MinimumVersion: '1.1'
Process:
- Processor: DeprecationWarning
  Arguments:
    warning_message: This recipe is now non-functional. Please remove it from your list of recipes.
- Processor: StopProcessingIf
  Arguments:
    predicate: TRUEPREDICATE
