# Downloaded from https://github.com/autopkg/nstrauss-recipes/blob/e58bfac92f1739258afd8cf246d148e1b60fd986/Google Drive/GoogleDrive.download.recipe
# Commit: e58bfac92f1739258afd8cf246d148e1b60fd986
# Downloaded at: 2026-02-22 01:50:32 UTC

Description: Downloads latest Google Drive disk image. Note Google Drive File Stream was rebranded to Google Drive for desktop, and this recipe updated to reflect the name change.
Identifier: com.github.nstrauss.download.GoogleDrive
Input:
  NAME: GoogleDrive
  DOWNLOAD_URL: https://dl.google.com/drive-file-stream/GoogleDrive.dmg
MinimumVersion: 0.3.1
Process:
- Processor: URLDownloader
  Arguments:
    url: '%DOWNLOAD_URL%'
    filename: '%NAME%.dmg'
- Processor: EndOfCheckPhase
- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%pathname%/GoogleDrive.pkg'
    expected_authority_names:
    - 'Developer ID Installer: Google LLC (EQHXZ8M8AV)'
    - Developer ID Certification Authority
    - Apple Root CA
