# Downloaded from https://github.com/autopkg/rtrouton-recipes/blob/7d4886a0c21b4990c2fe43b23bcaaf8477363734/MicrosoftOneDrive/MicrosoftOneDrive.pkg.recipe
# Commit: 7d4886a0c21b4990c2fe43b23bcaaf8477363734
# Downloaded at: 2026-02-22 01:47:33 UTC

Description: Downloads the current standalone Microsoft OneDrive installer, extracts version information and renames the installer package.
Identifier: com.github.rtrouton.pkg.microsoftonedrive
Input:
  NAME: Microsoft OneDrive
  VENDOR: Microsoft
  SOFTWARETITLE: OneDrive
  VERSIONTYPE: CFBundleShortVersionString
MinimumVersion: 0.6.0
ParentRecipe: com.github.rtrouton.download.microsoftonedrive
Process:
- Processor: FlatPkgUnpacker
  Arguments:
    flat_pkg_path: '%pathname%'
    destination_path: '%RECIPE_CACHE_DIR%/unpack'
- Processor: PkgPayloadUnpacker
  Arguments:
    pkg_payload_path: '%RECIPE_CACHE_DIR%/unpack/%SOFTWARETITLE%.pkg/Payload'
    destination_path: '%RECIPE_CACHE_DIR%/payload'
- Processor: Versioner
  Arguments:
    input_plist_path: '%RECIPE_CACHE_DIR%/payload/%SOFTWARETITLE%.app/Contents/Info.plist'
    plist_version_key: '%VERSIONTYPE%'
- Processor: PkgCopier
  Arguments:
    source_pkg: '%pathname%'
    pkg_path: '%RECIPE_CACHE_DIR%/%VENDOR%_%SOFTWARETITLE%_%version%.pkg'
- Processor: PathDeleter
  Arguments:
    path_list:
    - '%RECIPE_CACHE_DIR%/unpack'
    - '%RECIPE_CACHE_DIR%/payload'
