# Downloaded from https://github.com/autopkg/rtrouton-recipes/blob/7d4886a0c21b4990c2fe43b23bcaaf8477363734/MicrosoftOneDrive/MicrosoftOneDrive.install.recipe
# Commit: 7d4886a0c21b4990c2fe43b23bcaaf8477363734
# Downloaded at: 2026-02-22 01:47:32 UTC

Description: Downloads the current release version of the Microsoft OneDrive standalone installer package and installs it.
Identifier: com.github.rtrouton.install.microsoftonedrive
Input:
  NAME: Microsoft OneDrive
MinimumVersion: 1.0.0
ParentRecipe: com.github.rtrouton.pkg.microsoftonedrive
Process:
- Processor: Installer
