# Downloaded from https://github.com/autopkg/homebysix-recipes/blob/72c89c63ec1e18cd8991f2e20038f0c51842ecae/iMazing/iMazing.pkg.recipe
# Commit: 72c89c63ec1e18cd8991f2e20038f0c51842ecae
# Downloaded at: 2026-02-22 01:45:45 UTC

Comment: Created with Recipe Robot v1.0.3 (https://github.com/homebysix/recipe-robot)
Description: Downloads the latest version of iMazing and creates a package.
Identifier: com.github.homebysix.pkg.iMazing
Input:
  NAME: iMazing
MinimumVersion: 1.0.0
ParentRecipe: com.github.homebysix.download.iMazing
Process:
- Processor: AppPkgCreator
