# Downloaded from https://github.com/autopkg/homebysix-recipes/blob/72c89c63ec1e18cd8991f2e20038f0c51842ecae/iMazing/iMazing.munki.recipe
# Commit: 72c89c63ec1e18cd8991f2e20038f0c51842ecae
# Downloaded at: 2026-02-22 01:45:45 UTC

Comment: Created with Recipe Robot v1.0.3 (https://github.com/homebysix/recipe-robot)
Description: Downloads the latest version of iMazing and imports it into Munki.
Identifier: com.github.homebysix.munki.iMazing
Input:
  MUNKI_REPO_SUBDIR: apps/%NAME%
  NAME: iMazing
  pkginfo:
    catalogs:
    - testing
    description: iOS device manager.
    developer: DigiDNA, SARL
    display_name: iMazing
    name: '%NAME%'
    unattended_install: true
    unattended_uninstall: true
MinimumVersion: 0.6.1
ParentRecipe: com.github.homebysix.download.iMazing
Process:
- Processor: MunkiImporter
  Arguments:
    pkg_path: '%pathname%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
