# Downloaded from https://github.com/autopkg/grahampugh-recipes/blob/f718a53ed4392c9988c2ae079cd62c19a5cfd7e0/JamfComplianceEditor/JamfComplianceEditor.pkg.recipe.yaml
# Commit: f718a53ed4392c9988c2ae079cd62c19a5cfd7e0
# Downloaded at: 2026-02-22 01:45:59 UTC

Description: Downloads the latest version of Jamf Compliance Editor and creates a package.
Identifier: com.github.grahampugh.recipes.pkg.JamfComplianceEditor
ParentRecipe: com.github.grahampugh.recipes.download.JamfComplianceEditor
MinimumVersion: "2.3"

Input:
  NAME: Jamf Compliance Editor

Process:
  - Processor: PkgCopier
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/JamfComplianceEditor-%version%.pkg"
      source_pkg: "%pathname%"
