# Downloaded from https://github.com/autopkg/nmcspadden-recipes/blob/b43a0d0e955b08ac0ce61a92e026a893bec7234e/Xcode/XcodeVersionedName.munki.recipe
# Commit: b43a0d0e955b08ac0ce61a92e026a893bec7234e
# Downloaded at: 2025-11-27 22:26:49 UTC

Copyright: Copyright (c) Facebook, Inc. and its affiliates. All Rights Reserved
Description: Download, extract, and import Xcode as a unique entry into Munki. You must override the APPLE_ID and one of PASSWORD or PASSWORD_FILE.
Identifier: com.github.nmcspadden.munki.xcode_versioned
Input:
  APPLE_ID: dev@domain.com
  DESTINATION_APP_NAME: Xcode.app
  ICON_NAME: Xcode.png
  MUNKI_REPO_SUBDIR: apps/apple/xcode/
  NAME: Xcode
  ARBITRARY_SUFFIX: ''
  pkginfo:
    catalogs:
    - testing
    description: Xcode
    display_name: '%NAME%'
    name: '%NAME%'
    unattended_install: true
MinimumVersion: 1.0.4
ParentRecipe: com.github.nmcspadden.extract.xcode
Process:
- Processor: XcodeVersioner
  Arguments:
    version: '%version%'
- Processor: FileMover
  Arguments:
    source: '%found_filename%'
    target: '%RECIPE_CACHE_DIR%/%NAME%_%major_version%.%minor_version%.%patch_version%%ARBITRARY_SUFFIX%.app'
- Processor: DmgCreator
  Arguments:
    dmg_path: '%RECIPE_CACHE_DIR%/%NAME%_%major_version%.%minor_version%.%patch_version%.dmg'
    dmg_root: '%RECIPE_CACHE_DIR%/%NAME%_%major_version%.%minor_version%.%patch_version%%ARBITRARY_SUFFIX%.app'
- Processor: MunkiPkginfoMerger
  Arguments:
    additional_pkginfo:
      display_name: '%NAME% %major_version%.%minor_version%.%patch_version%'
      icon_name: '%ICON_NAME%'
      name: '%NAME%%major_version%'
      version: '%major_version%.%minor_version%.%patch_version%'
- Processor: MunkiImporter
  Arguments:
    pkg_path: '%RECIPE_CACHE_DIR%/%NAME%_%major_version%.%minor_version%.%patch_version%.dmg'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
- Processor: PathDeleter
  Arguments:
    path_list:
    - '%RECIPE_CACHE_DIR%/%NAME%_unpack'
    - '%RECIPE_CACHE_DIR%/%NAME%_%major_version%.%minor_version%.%patch_version%%ARBITRARY_SUFFIX%.app'
