# Downloaded from https://github.com/autopkg/rtrouton-recipes/blob/7d4886a0c21b4990c2fe43b23bcaaf8477363734/MicrosoftWord365/MicrosoftWord365.install.recipe
# Commit: 7d4886a0c21b4990c2fe43b23bcaaf8477363734
# Downloaded at: 2026-02-22 01:46:39 UTC

Description: Downloads the current release version of the Microsoft Word installer package for Office 365 and installs it.
Identifier: com.github.rtrouton.install.microsoftword365
Input:
  NAME: Microsoft Word
MinimumVersion: 1.0.0
ParentRecipe: com.github.rtrouton.pkg.microsoftword365
Process:
- Processor: Installer
