# Downloaded from https://github.com/autopkg/kevinmcox-recipes/blob/b0420a50e4532aa401412eefec8a77683b2d5d81/Mothers Ruin Software/Apparency.munki.recipe
# Commit: b0420a50e4532aa401412eefec8a77683b2d5d81
# Downloaded at: 2026-02-22 01:48:40 UTC

Description: Downloads the latest version of the Apparency application and imports it into Munki.
Identifier: com.github.kevinmcox.munki.Apparency
Input:
  NAME: Apparency
  repo_subdirectory: utilities
  pkginfo:
    catalogs:
    - testing
    category: Utilities
    description: Aparency is an application for inspecting other applications.
    developer: Mothers Ruin Software
    display_name: Apparency
    icon_name: Apparency.png
    name: '%NAME%'
    unattended_install: true
    unattended_uninstall: true
    uninstallable: true
MinimumVersion: 1.0.0
ParentRecipe: com.github.kevinmcox.download.Apparency
Process:
- Processor: MunkiImporter
  Arguments:
    pkg_path: '%pathname%'
