# Downloaded from https://github.com/autopkg/kevinmcox-recipes/blob/b0420a50e4532aa401412eefec8a77683b2d5d81/Mothers Ruin Software/Archaeology.install.recipe
# Commit: b0420a50e4532aa401412eefec8a77683b2d5d81
# Downloaded at: 2026-02-22 01:48:41 UTC

Description: Installs the latest version of Archaeology.
Identifier: com.github.kevinmcox.install.Archaeology
Input:
  NAME: Archaeology
MinimumVersion: 2.7.2
ParentRecipe: com.github.kevinmcox.download.Archaeology
Process:
- Processor: InstallFromDMG
  Arguments:
    dmg_path: '%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg'
    items_to_copy:
    - destination_path: /Applications
      source_item: Archaeology.app
