# Downloaded from https://github.com/autopkg/homebysix-recipes/blob/26f97759822c6c90b8f458f35b82ff9496785c71/Zoom/ZoomPresence.munki.recipe
# Commit: 26f97759822c6c90b8f458f35b82ff9496785c71
# Downloaded at: 2025-11-27 22:32:34 UTC

Comment: Created with Recipe Robot v0.0.4 (https://github.com/homebysix/recipe-robot)
Description: Downloads the latest version of the Zoom Rooms (Mac) application and imports it into Munki.
Identifier: com.github.homebysix.munki.ZoomPresence
Input:
  MUNKI_REPO_SUBDIR: apps/Zoom
  NAME: ZoomPresence
  pkginfo:
    blocking_applications:
    - ZoomPresence.app
    catalogs:
    - testing
    description: Zoom Rooms application to setup your conference room for one-touch meeting and calendar integration.
    developer: Zoom Video Communications, Inc.
    display_name: Zoom Rooms
    name: '%NAME%'
    unattended_install: true
    unattended_uninstall: true
MinimumVersion: 1.0.1
ParentRecipe: com.github.homebysix.download.ZoomPresence
Process:
- Processor: MunkiImporter
  Arguments:
    pkg_path: '%pathname%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
