# Downloaded from https://github.com/autopkg/homebysix-recipes/blob/72c89c63ec1e18cd8991f2e20038f0c51842ecae/Zoom/ZoomPresence.pkg.recipe
# Commit: 72c89c63ec1e18cd8991f2e20038f0c51842ecae
# Downloaded at: 2026-02-22 01:49:36 UTC

Description: Downloads the current release version of Zoom Rooms and builds a package.
Identifier: com.github.homebysix.pkg.ZoomPresence
Input:
  NAME: ZoomPresence
MinimumVersion: 1.0.1
ParentRecipe: com.github.homebysix.download.ZoomPresence
Process:
- Processor: FlatPkgUnpacker
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/expanded'
    flat_pkg_path: '%pathname%'
- Processor: PkgPayloadUnpacker
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/expanded/ZoomPresence.app'
    pkg_payload_path: '%RECIPE_CACHE_DIR%/expanded/zp.pkg/Payload'
- Processor: Versioner
  Arguments:
    input_plist_path: '%RECIPE_CACHE_DIR%/expanded/ZoomPresence.app/Contents/Info.plist'
- Processor: com.github.homebysix.VersionSplitter/VersionSplitter
- Processor: PkgCopier
  Arguments:
    pkg_path: '%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg'
    source_pkg: '%pathname%'
- Processor: PathDeleter
  Arguments:
    path_list:
    - '%RECIPE_CACHE_DIR%/expanded'
