# Downloaded from https://github.com/autopkg/homebysix-recipes/blob/72c89c63ec1e18cd8991f2e20038f0c51842ecae/Zoom/Zoom.install.recipe
# Commit: 72c89c63ec1e18cd8991f2e20038f0c51842ecae
# Downloaded at: 2026-02-22 01:49:33 UTC

Description: Installs the latest version of Zoom.
Identifier: com.github.homebysix.install.Zoom
Input:
  NAME: Zoom
MinimumVersion: 1.0.1
ParentRecipe: com.github.homebysix.pkg.Zoom
Process:
- Processor: Installer
