# Downloaded from https://github.com/autopkg/hansen-m-recipes/blob/76ca42243d2d45d2704ae28473ca40e329d12458/Zoom/Zoom-Win.download.recipe
# Commit: 76ca42243d2d45d2704ae28473ca40e329d12458
# Downloaded at: 2026-02-22 01:49:37 UTC

Description: Downloads the latest version of Zoom.
Identifier: com.github.hansen-m.download.zoom-win
Input:
  NAME: Zoom
  DOWNLOAD_URL: https://zoom.us/client/latest/ZoomInstallerFull.msi
  USER_AGENT: Mozilla/5.0 (Windows NT 10.0; Win64; x64)
MinimumVersion: 0.2.0
Process:
- Processor: URLDownloader
  Arguments:
    url: '%DOWNLOAD_URL%'
    request_headers:
      user-agent: '%USER_AGENT%'
    filename: '%NAME%.msi'
- Processor: EndOfCheckPhase
- Processor: com.github.jgstew.SharedProcessors/FileMsiGetProperty
  Arguments:
    custom_msi_property: ARPCOMMENTS
    msi_path: '%pathname%'
