# Downloaded from https://github.com/autopkg/hansen-m-recipes/blob/de17d7db2537ffa00c27281a392f37fe599efdca/Zoom/Zoom.download.recipe
# Commit: de17d7db2537ffa00c27281a392f37fe599efdca
# Downloaded at: 2025-11-27 22:32:35 UTC

Description: Downloads the latest version of Zoom.
Identifier: com.github.hansen-m.download.zoomus
Input:
  NAME: Zoom
  DOWNLOAD_URL: https://zoom.us/client/latest/ZoomInstallerIT.pkg
  USER_AGENT: Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_3) AppleWebKit/536.28.10 (KHTML, like Gecko) Version/6.0.3 Safari/536.28.10
MinimumVersion: 0.3.1
Process:
- Processor: URLDownloader
  Arguments:
    url: '%DOWNLOAD_URL%'
    request_headers:
      user-agent: '%USER_AGENT%'
    filename: '%NAME%.pkg'
- Processor: EndOfCheckPhase
- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%pathname%'
    expected_authority_names:
    - 'Developer ID Installer: Zoom Video Communications, Inc. (BJ4HAAB9B3)'
    - Developer ID Certification Authority
    - Apple Root CA
