# Downloaded from https://github.com/autopkg/homebysix-recipes/blob/26f97759822c6c90b8f458f35b82ff9496785c71/Zoom/ZoomPresence.install.recipe
# Commit: 26f97759822c6c90b8f458f35b82ff9496785c71
# Downloaded at: 2025-11-27 22:32:34 UTC

Comment: Created with Recipe Robot v0.0.4 (https://github.com/homebysix/recipe-robot)
Description: Installs the latest version of the Zoom Rooms (Mac) application to setup your conference room for one-touch meeting and calendar integration.
Identifier: com.github.homebysix.install.ZoomPresence
Input:
  NAME: ZoomPresence
MinimumVersion: 1.0.1
ParentRecipe: com.github.homebysix.download.ZoomPresence
Process:
- Processor: Installer
  Arguments:
    pkg_path: '%pathname%'
