# Downloaded from https://github.com/autopkg/hansen-m-recipes/blob/76ca42243d2d45d2704ae28473ca40e329d12458/Zoom/Zoom.download.recipe
# Commit: 76ca42243d2d45d2704ae28473ca40e329d12458
# Downloaded at: 2026-02-22 01:49:38 UTC

Description: Downloads the latest version of Zoom.
Identifier: com.github.hansen-m.download.zoomus
Input:
  NAME: Zoom
  DOWNLOAD_URL: https://zoom.us/client/latest/ZoomInstallerIT.pkg
  USER_AGENT: Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_3) AppleWebKit/536.28.10 (KHTML, like Gecko) Version/6.0.3 Safari/536.28.10
MinimumVersion: 0.3.1
Process:
- Processor: URLDownloader
  Arguments:
    url: '%DOWNLOAD_URL%'
    request_headers:
      user-agent: '%USER_AGENT%'
    filename: '%NAME%.pkg'
- Processor: EndOfCheckPhase
- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%pathname%'
    expected_authority_names:
    - 'Developer ID Installer: Zoom Video Communications, Inc. (BJ4HAAB9B3)'
    - Developer ID Certification Authority
    - Apple Root CA
