# Downloaded from https://github.com/autopkg/homebysix-recipes/blob/72c89c63ec1e18cd8991f2e20038f0c51842ecae/Zoom/Zoom.pkg.recipe
# Commit: 72c89c63ec1e18cd8991f2e20038f0c51842ecae
# Downloaded at: 2026-02-22 01:49:34 UTC

Description: Downloads the current release version of Zoom and builds a package.
Identifier: com.github.homebysix.pkg.Zoom
Input:
  BUNDLE_ID: us.zoom.xos
  NAME: Zoom
MinimumVersion: '1.1'
ParentRecipe: com.github.hansen-m.download.zoomus
Process:
- Processor: FlatPkgUnpacker
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/FlatPkgUnpacker'
    flat_pkg_path: '%pathname%'
    purge_destination: true
- Processor: PkgPayloadUnpacker
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/PkgPayloadUnpacker/Applications'
    pkg_payload_path: '%RECIPE_CACHE_DIR%/FlatPkgUnpacker/zoomus.pkg/Payload'
    purge_destination: true
- Processor: PlistReader
  Arguments:
    info_path: '%destination_path%/zoom.us.app/Contents/Info.plist'
    plist_keys:
      CFBundleShortVersionString: jamfversion
      CFBundleVersion: version
      LSMinimumSystemVersion: min_os_version
- Processor: PkgCopier
  Arguments:
    pkg_path: '%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg'
    source_pkg: '%pathname%'
- Processor: PathDeleter
  Arguments:
    path_list:
    - '%RECIPE_CACHE_DIR%/FlatPkgUnpacker'
  Comment: Cleans up resources from FlatPkgUnpacker processor run (leaves PkgPayloadUnpacker resources for child recipes).
