# Downloaded from https://github.com/autopkg/homebysix-recipes/blob/26f97759822c6c90b8f458f35b82ff9496785c71/Zoom/Zoom.install.recipe
# Commit: 26f97759822c6c90b8f458f35b82ff9496785c71
# Downloaded at: 2025-11-27 22:32:33 UTC

Description: Installs the latest version of Zoom.
Identifier: com.github.homebysix.install.Zoom
Input:
  NAME: Zoom
MinimumVersion: 1.0.1
ParentRecipe: com.github.homebysix.pkg.Zoom
Process:
- Processor: Installer
