# Downloaded from https://github.com/autopkg/jc0b-recipes/blob/b4e4e63fffb5609ba8a82236dcfbdb1d75c83aea/Fleet/fleetctl.munki.recipe.yaml
# Commit: b4e4e63fffb5609ba8a82236dcfbdb1d75c83aea
# Downloaded at: 2026-02-22 01:49:57 UTC

Description: Gets the latest version of fleetctl, and imports it into Munki.
Identifier: com.github.jc0b.munki.fleetctl
ParentRecipe: com.github.jc0b.pkg.fleetctl
MinimumVersion: "2.7.6"

Input:
  NAME: fleetctl
  MUNKI_REPO_SUBDIR: "apps/fleetctl"
  pkginfo:
    catalogs:
      - testing
    description: >
      fleetctl (pronounced "Fleet control") is a command line interface (CLI) tool for managing Fleet from the command line. fleetctl enables a GitOps workflow with Fleet.
      fleetctl also provides a quick way to work with all the data exposed by Fleet without having to use the Fleet UI or work directly with the Fleet API.
    display_name: "%NAME%"
    minimum_os_version: "12.0"
    name: "%NAME%"
    version_script: |
      #!/bin/sh
      /usr/local/bin/fleetctl --version | /usr/bin/awk '/^fleetctl/{print $4}'

Process:
  - Processor: MunkiInstallsItemsCreator
    Arguments:
      faux_root: "%RECIPE_CACHE_DIR%/pkg_root"
      installs_item_paths:
        - "/usr/local/bin/fleetctl"

  - Processor: MunkiPkginfoMerger

  - Processor: MunkiImporter
    Arguments:
      pkg_path: "%pkg_path%"
      repo_subdirectory: "%MUNKI_REPO_SUBDIR%"

  - Processor: PathDeleter
    Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/%NAME%"
        - "%RECIPE_CACHE_DIR%/pkg_root"
