# Downloaded from https://github.com/autopkg/jc0b-recipes/blob/b4e4e63fffb5609ba8a82236dcfbdb1d75c83aea/Fleet/fleetd.munki.recipe.yaml
# Commit: b4e4e63fffb5609ba8a82236dcfbdb1d75c83aea
# Downloaded at: 2026-02-21 05:59:02 UTC

Identifier: com.github.jc0b.munki.fleetd
Description: Imports a fleetd package into Munki.
MinimumVersion: "2.3"
ParentRecipe: com.github.jc0b.download.fleetd

Input:
  MUNKI_REPO_SUBDIR: fleetdm/fleetd
  NAME: fleetd
  pkginfo:
    catalogs:
      - testing
    description: fleetd is a monitoring agent leveraging osquery.
    developer: Fleet Device Management, Inc.
    display_name: FleetDM
    name: "%NAME%"
    unattended_install: true
    uninstall_method: removepackages

Process:
  - Processor: FlatPkgUnpacker
    Arguments:
      destination_path: "%RECIPE_CACHE_DIR%/unpack"
      flat_pkg_path: "%pathname%"
      purge_destination: true

  - Processor: PkgPayloadUnpacker
    Arguments:
      destination_path: "%RECIPE_CACHE_DIR%/payload"
      pkg_payload_path: "%RECIPE_CACHE_DIR%/unpack/base.pkg/Payload"
      purge_destination: true

  - Processor: MunkiInstallsItemsCreator
    Arguments:
      faux_root: "%RECIPE_CACHE_DIR%/payload"
      installs_item_paths: 
        - "/Library/LaunchDaemons/com.fleetdm.orbit.plist"

  - Processor: MunkiPkginfoMerger

  - Processor: MunkiImporter
    Arguments:
      pkg_path: "%pathname%"
      repo_subdirectory: "%MUNKI_REPO_SUBDIR%"
