# Downloaded from https://github.com/autopkg/homebysix-recipes/blob/72c89c63ec1e18cd8991f2e20038f0c51842ecae/GitHub/GitHubCLI.install.recipe
# Commit: 72c89c63ec1e18cd8991f2e20038f0c51842ecae
# Downloaded at: 2026-02-22 01:45:32 UTC

Description: Installs the latest version of the GitHub command line tool.
Identifier: com.github.homebysix.install.GitHubCLI
Input:
  NAME: GitHub CLI
MinimumVersion: 1.4.1
ParentRecipe: com.github.homebysix.pkg.GitHubCLI
Process:
- Processor: Installer
