# Downloaded from https://github.com/autopkg/homebysix-recipes/blob/72c89c63ec1e18cd8991f2e20038f0c51842ecae/Elliot Jordan/touchbarlib.download.recipe
# Commit: 72c89c63ec1e18cd8991f2e20038f0c51842ecae
# Downloaded at: 2026-02-22 01:47:46 UTC

Description: Downloads the current release of touchbarlib from Github.
Identifier: com.github.homebysix.download.touchbarlib
Input:
  NAME: touchbarlib
MinimumVersion: 1.0.0
Process:
- Processor: GitHubReleasesInfoProvider
  Arguments:
    github_repo: homebysix/touchbarlib
- Processor: URLDownloader
  Arguments:
    filename: '%NAME%-%version%.pkg'
- Processor: EndOfCheckPhase
